stm32-hotspot/STM32-Sidewalk-SDK/pal/st/stm32wba/sid_pal/ble_adapter/sid_pal_ble_adapter_stm32wba.c
/**
  ******************************************************************************
  * @file    sid_pal_ble_adapter_stm32wba.c
  * @brief   Sidewalk BLE driver for STM32WBA host MCU
  * 
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2023-2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/

#include <assert.h>
#include <stdint.h>
#include <stdlib.h>
#include <string.h>

#include "bluetooth_hci_defs.h"
#include "host_ble.h"
#include "sid_pal_ble_adapter_stm32wba.h"
#include "sid_pal_ble_adapter_stm32wba_config.h"
#include "sid_pal_ble_adapter_stm32wba_ext_ifc.h"
#include "sid_pal_ble_adapter_stm32wba_private_defs.h"
#include "sid_pal_ble_adapter_stm32wba_sidewalk_gap_gatt.h"
#if (SID_STM32_BLE_COEXISTENCE_MODE == SID_STM32_BLE_COEXISTENCE_MODE_INTERLEAVING) || (SID_STM32_BLE_COEXISTENCE_MODE == SID_STM32_BLE_COEXISTENCE_MODE_CONCURRENCY)
#  include "sid_pal_ble_adapter_stm32wba_user_gap_gatt.h"
#endif /* SID_STM32_BLE_COEXISTENCE_MODE */
#include "sid_pal_ble_adapter_stm32wba_utils.h"

/* Sidewalk interfaces */
#include <sid_pal_ble_adapter_ifc.h>
#include <sid_ble_config_ifc.h>
#include <sid_pal_assert_ifc.h>
#include <sid_pal_critical_region_ifc.h>
#include <sid_pal_log_ifc.h>

/* BLE stack */
#include <advanced_memory_manager.h>
#include <ble_core.h>
#include <ble_const.h>
#include <blestack.h>
#include <host_stack_if.h>
#include <ll_sys.h>
#include "ll_sys_if.h"
#include <ll_sys_startup.h>

/* BLE stack dependencies  */
#include <ble_timer.h>
#include <flash_driver.h>
#include <hw.h>
#include <simple_nvm_arbiter.h>

/* Platform-specific headers */
#include "stm32_rtos.h"
#include <stm32wbaxx_hal.h>

/* Utilities and helpers */
#include <sid_stm32_common_utils.h>
#include <stm_list.h>
#include <stm32_timer.h>

/* Private defines -----------------------------------------------------------*/

#define BLE_HAL_ENABLE_RADIO_ACTIVITY_EVENT_ADVERTISING             (0x0002u)
#define BLE_HAL_ENABLE_RADIO_ACTIVITY_EVENT_CONNECTION              (0x0004u)

#define SID_STM32_BLE_PRV_CI_GAP_SECURITY_CFG_FIXED_PIN_ENABLED     (0x00u)
#define SID_STM32_BLE_PRV_CI_GAP_SECURITY_CFG_FIXED_PIN_DISABLED    (0x01u)

#ifndef SID_STM32_BLE_ENHANCED_MTU_EXCHANGE_HANDLING
#  error "SID_STM32_BLE_ENHANCED_MTU_EXCHANGE_HANDLING is not defined. Please set it explicitly"
#endif /* SID_STM32_BLE_ENHANCED_MTU_EXCHANGE_HANDLING */

#if SID_STM32_BLE_ENHANCED_MTU_EXCHANGE_HANDLING
#  define SID_STM32_BLE_PRV_L2CAP_PDU_SZ(_PDU_)                     (sizeof(sid_pal_ble_prv_l2cap_pdu_t) - SID_STM32_UTIL_STRUCT_MEMBER_SIZE(sid_pal_ble_prv_att_pdu_t, raw) + SID_STM32_UTIL_STRUCT_MEMBER_SIZE(sid_pal_ble_prv_att_pdu_t, _PDU_))
#  define SID_STM32_BLE_PRV_ATT_EXCHANGE_MTU_REQ_SZ                 (SID_STM32_BLE_PRV_L2CAP_PDU_SZ(exchange_mtu_req))
#  define SID_STM32_BLE_PRV_ATT_EXCHANGE_MTU_RSP_SZ                 (SID_STM32_BLE_PRV_L2CAP_PDU_SZ(exchange_mtu_rsp))
#  define SID_STM32_BLE_PRV_ATT_EXCHANGE_MTU_REQ_OPCODE             (0x02u) /* As per ATT protocol specification in Core Specification Volume 3, Part F */
#  define SID_STM32_BLE_PRV_ATT_EXCHANGE_MTU_RSP_OPCODE             (0x03u) /* As per ATT protocol specification in Core Specification Volume 3, Part F */
#endif /* SID_STM32_BLE_ENHANCED_MTU_EXCHANGE_HANDLING */

#define SID_STM32_BLE_PRV_RANDOM_ADDR_SPECIFIER_MASK                (0xC0u)
#define SID_STM32_BLE_PRV_RANDOM_ADDR_TYPE_RPA_MASK                 (0x40u)

#define SID_STM32_BLE_PRV_ADVERTISING_CMD_QUEUE_LEN                 (2u)

#define SID_STM32_WPAN_STACK_EXPECTED_BUILD_NUMBER                  (0x100Fu) /* Version information reported by the STM32_WPAN stack v2.7.0 */

/* Private macro -------------------------------------------------------------*/

#ifndef SID_BLE_GENERIC_EXTRA_LOGGING
/* Set SID_BLE_GENERIC_EXTRA_LOGGING to 1 to enable extended logs */
#  define SID_BLE_GENERIC_EXTRA_LOGGING                             (0)
#endif

#if SID_BLE_GENERIC_EXTRA_LOGGING
#  define SID_BLE_GENERIC_LOG_ERROR(...)                            SID_PAL_LOG_ERROR(__VA_ARGS__)
#  define SID_BLE_GENERIC_LOG_WARNING(...)                          SID_PAL_LOG_WARNING(__VA_ARGS__)
#  define SID_BLE_GENERIC_LOG_INFO(...)                             SID_PAL_LOG_INFO(__VA_ARGS__)
#  define SID_BLE_GENERIC_LOG_DEBUG(...)                            SID_PAL_LOG_DEBUG(__VA_ARGS__)
#  define SID_BLE_GENERIC_LOG_TRACE(...)                            SID_PAL_LOG_TRACE(__VA_ARGS__)
#else
#  define SID_BLE_GENERIC_LOG_ERROR(...)                            ((void)0u)
#  define SID_BLE_GENERIC_LOG_WARNING(...)                          ((void)0u)
#  define SID_BLE_GENERIC_LOG_INFO(...)                             ((void)0u)
#  define SID_BLE_GENERIC_LOG_DEBUG(...)                            ((void)0u)
#  define SID_BLE_GENERIC_LOG_TRACE(...)                            ((void)0u)
#endif

#define BLE_ADAPTER_DBM_TO_INT(__X__)                               ((int16_t)((float)(__X__) * 100.f))

#define BLE_ADAPTER_MS_TO_OS_TICKS(__MS__)                          ((((__MS__) * osKernelGetTickFreq()) + 999u) / 1000u)                            /*!< Convert milliseconds to RTOS ticks with math ceiling */
#define BLE_ADAPTER_OS_TICKS_TO_MS(__TICKS__)                       ((((__TICKS__) * 1000u) + (osKernelGetTickFreq() - 1u)) / osKernelGetTickFreq()) /*!< Convert RTOS ticks to milliseconds with math ceiling */

#define BLE_ADAPTER_CALCULATE_DISCONNECT_TIMEOUT_MS(_CONN_CTX_)     (SID_STM32_BLE_CONN_SUPERVISION_UNITS_TO_MS((_CONN_CTX_)->public_ctx.supervision_timeout) + SID_STM32_BLE_DISCONNECT_TIMEOUT_ALLOWANCE_MS)

/* Private typedef -----------------------------------------------------------*/

#if SID_STM32_BLE_ENHANCED_MTU_EXCHANGE_HANDLING

/* L2CAP header definition */
typedef __PACKED_STRUCT {
    uint8_t  code;
    uint8_t  identifier;
    uint16_t length;
} sid_pal_ble_prv_l2cap_header_t;

/* ATT protocol data for ATT_EXCHANGE_MTU_REQ PDU */
typedef __PACKED_STRUCT {
    uint16_t client_rx_mtu;
} sid_pal_ble_prv_att_exchange_mtu_req_t;

