stm32-hotspot/STM32-Sidewalk-SDK/pal/st/stm32wba/sid_pal/ble_adapter/sid_pal_ble_adapter_stm32wba.c
/* ATT protocol data for ATT_EXCHANGE_MTU_RSP PDU */
typedef __PACKED_STRUCT {
    uint16_t server_rx_mtu;
} sid_pal_ble_prv_att_exchange_mtu_rsp_t;

/* Generic definition of ATT protocol PDU */
typedef __PACKED_STRUCT {
    uint8_t opcode;
    __PACKED_UNION {
        uint8_t                                raw[246]; /* 22 bytes without data length extensions */
        sid_pal_ble_prv_att_exchange_mtu_req_t exchange_mtu_req;
        sid_pal_ble_prv_att_exchange_mtu_rsp_t exchange_mtu_rsp;
    };
} sid_pal_ble_prv_att_pdu_t;

/* L2CAP PDU definition */
typedef __PACKED_STRUCT {
    sid_pal_ble_prv_l2cap_header_t header;
    sid_pal_ble_prv_att_pdu_t      att_pdu;
} sid_pal_ble_prv_l2cap_pdu_t;

/* Mock of the BLE stack-specific data frame object */
typedef __PACKED_STRUCT {
    uint32_t                      __dummy0;
    uint16_t                      frame_len;   /*!< Full length of the L2CAP frame, including L2CAP header */
    uint16_t                      __dummy1;
    uint32_t                      __dummy2[6];
    sid_pal_ble_prv_l2cap_pdu_t * l2cap_frame;
} sid_pal_ble_prv_client_pdu_mock_t;

/* Mock of the BLE stack-specific connection context */
typedef __PACKED_STRUCT {
    uint16_t conn_handle; /*!< BLE connection handle for this packet*/
    uint16_t mtu_size;    /*!< Currently applied MTU */
} sid_pal_ble_prv_conn_ctx_mock_t;

#endif /* SID_STM32_BLE_ENHANCED_MTU_EXCHANGE_HANDLING */

/* Characteristic definition (BLE stack internal format) */
typedef __PACKED_STRUCT
{
    uint16_t    Service_Handle;
    uint8_t     Char_UUID_Type;
    uint8_t     : 8; /* Padding */
    Char_UUID_t Char_UUID;
    uint16_t    Char_Value_Length;
    uint8_t     Char_Properties;
    uint8_t     Security_Permissions;
    uint8_t     GATT_Evt_Mask;
    uint8_t     Enc_Key_Size;
    uint8_t     Is_Variable;
} gatt_add_char_core_params_t;

/* Exported variables --------------------------------------------------------*/

osSemaphoreId_t BleHostSemaphore = NULL; /* The name of this semaphore shall be aligned with the BLE stack / CubeMX FW pack (host_stack_if.c) */

/* Private variables ---------------------------------------------------------*/

sid_pal_ble_adapter_ctx_t sid_ble_drv_ctx                       = {0};

static osThreadId_t       ble_host_task                         = NULL;
static osThreadId_t       hci_async_evt_task                    = NULL;
static osSemaphoreId_t    hci_async_evt_semaphore               = NULL;
static tListNode          BleAsynchEventQueue                   = {0};
static uint64_t           host_nvm_buffer[CFG_BLE_NVM_SIZE_MAX] = {0};

static AMM_VirtualMemoryCallbackFunction_t ble_amm_cb = {0};

/* Private constants ---------------------------------------------------------*/

static const osSemaphoreAttr_t ble_host_semaphore_atributes = {
    .name       = "BLE Host Semaphore",
    .attr_bits  = SEMAPHORE_DEFAULT_ATTR_BITS,
    .cb_mem     = SEMAPHORE_DEFAULT_CB_MEM,
    .cb_size    = SEMAPHORE_DEFAULT_CB_SIZE,
};

static const osThreadAttr_t ble_host_task_atributes = {
    .name       = "BLE Host Task",
    .priority   = TASK_PRIO_BLE_HOST,
    .stack_size = TASK_STACK_SIZE_BLE_HOST,
    .attr_bits  = TASK_DEFAULT_ATTR_BITS,
    .cb_mem     = TASK_DEFAULT_CB_MEM,
    .cb_size    = TASK_DEFAULT_CB_SIZE,
    .stack_mem  = TASK_DEFAULT_STACK_MEM,
};

static const osThreadAttr_t hci_async_evt_task_attributes = {
    .name       = "HCI async Event Task",
    .priority   = TASK_PRIO_HCI_ASYNC_EVENT,
    .stack_size = TASK_STACK_SIZE_HCI_ASYNC_EVENT,
    .attr_bits  = TASK_DEFAULT_ATTR_BITS,
    .cb_mem     = TASK_DEFAULT_CB_MEM,
    .cb_size    = TASK_DEFAULT_CB_SIZE,
    .stack_mem  = TASK_DEFAULT_STACK_MEM,
};

static const osSemaphoreAttr_t hci_async_evt_semaphore_attributes = {
    .name       = "HCI async Event Semaphore",
    .attr_bits  = SEMAPHORE_DEFAULT_ATTR_BITS,
    .cb_mem     = SEMAPHORE_DEFAULT_CB_MEM,
    .cb_size    = SEMAPHORE_DEFAULT_CB_SIZE,
};

#if (SID_STM32_BLE_EXTENDED_ADV_SUPPORTED == 0)
static const osThreadAttr_t advertising_cmd_task_attributes = {
    .name       = "Advertising Cmd Task",
    .priority   = osPriorityBelowNormal,
    .stack_size = 1216u,
    .attr_bits  = TASK_DEFAULT_ATTR_BITS,
    .cb_mem     = TASK_DEFAULT_CB_MEM,
    .cb_size    = TASK_DEFAULT_CB_SIZE,
    .stack_mem  = TASK_DEFAULT_STACK_MEM,
};

static const osMessageQueueAttr_t advertising_cmd_queue_attributes = {
    .name       = "Advertising Cmd Queue",
    .attr_bits  = QUEUE_DEFAULT_ATTR_BITS,
    .cb_mem     = QUEUE_DEFAULT_CB_MEM,
    .cb_size    = QUEUE_DEFAULT_CB_SIZE,
    .mq_mem     = QUEUE_DEFAULT_MQ_MEM,
    .mq_size    = QUEUE_DEFAULT_MQ_SIZE,
};
#endif /* SID_STM32_BLE_EXTENDED_ADV_SUPPORTED */

/* Imported variables --------------------------------------------------------*/

extern sid_pal_ble_sidewalk_link_ctx_t sid_ble_sidewalk_ctx;

/* Imported function prototypes ----------------------------------------------*/

extern tBleStatus GAP_Set_Own_Address(uint8_t own_addr_type_req, uint8_t * const out_own_addr_type, uint8_t addr[6]);

/* Private function prototypes -----------------------------------------------*/

static inline const char *                       _ble_adapter_generic_aci_warning_display_str(const uint8_t warning_type);
static inline const char *                       _ble_adapter_generic_peer_addr_type_display_str(const sid_pal_ble_ext_peer_addr_type_t addr_type, const uint8_t addr_msb);
static inline const char *                       _ble_adapter_generic_phy_type_display_str(const sid_pal_ble_ext_le_phy_t phy_type);

static        void                               _ble_adapter_generic_resume_flow_process(void);
static        void                               BLE_NvmCallback(SNVMA_Callback_Status_t CbkStatus);
static inline void                               _gap_cmd_resp_release(const sid_pal_ble_prv_connection_ctx_t * const conn_ctx);
static        void                               BleStack_Process_BG_Entry(void* thread_input);
static inline void                               BleStack_Process_BG(void);
static        void                               Ble_UserEvtRx_Entry(void* thread_input);
static        void                               Ble_UserEvtRx(void);

static inline void                               _ble_adapter_generic_svc_event_handling_init(void);
static        SVCCTL_EvtAckStatus_t              _ble_adapter_generic_svc_event_router(void * p_evt);
static inline SVCCTL_UserEvtFlowStatus_t         _ble_adapter_generic_process_hci_le_meta_evt(const evt_le_meta_event * const evt);
static inline SVCCTL_UserEvtFlowStatus_t         _ble_adapter_generic_process_aci_evt(const evt_blecore_aci * const evt);

