stm32-hotspot/STM32-Sidewalk-SDK/pal/st/stm32wba/sid_pal/ble_adapter/sid_pal_ble_adapter_stm32wba.c
#if (SID_STM32_BLE_EXTENDED_ADV_SUPPORTED == 0)
static        void                               _ble_adapter_generic_adv_duration_timer_cb(void *arg);
static        void                               _ble_adapter_generic_adv_cmd_task_entry(void* thread_input);
#endif /* SID_STM32_BLE_EXTENDED_ADV_SUPPORTED */

static inline sid_error_t                        _ble_adapter_generic_conn_ctxs_init(void);
static inline void                               _ble_adapter_generic_conn_ctxs_deinit(void);
static inline void                               _ble_adapter_generic_invalidate_conn_ctx(sid_pal_ble_prv_connection_ctx_t * const ctx);
static inline sid_pal_ble_prv_connection_ctx_t * _ble_adapter_generic_get_free_conn_ctx(const uint16_t conn_handle);
static inline sid_pal_ble_prv_connection_ctx_t * _ble_adapter_generic_get_conn_ctx_for_handle(const uint16_t conn_handle);

static        sid_error_t                        _ble_stack_init(const sid_pal_ble_prv_operating_mode_t init_type);
static        sid_error_t                        _reload_bonded_devices(void);
static        sid_error_t                        _gap_and_gatt_params_init(const sid_pal_ble_prv_operating_mode_t init_type);

/* Private constants ---------------------------------------------------------*/

/**
 * @brief Look-up table to convert HW-speciifc Tx power indexes to the physical values in dBm
 */
static const int16_t ble_tx_pwr_to_dbm_lut[] = {
    BLE_ADAPTER_DBM_TO_INT(-20.4),
    BLE_ADAPTER_DBM_TO_INT(-20.4),
    BLE_ADAPTER_DBM_TO_INT(-20.4),
    BLE_ADAPTER_DBM_TO_INT(-20.4),
    BLE_ADAPTER_DBM_TO_INT(-20.4),
    BLE_ADAPTER_DBM_TO_INT(-20.4),
    BLE_ADAPTER_DBM_TO_INT(-19.4),
    BLE_ADAPTER_DBM_TO_INT(-18.3),
    BLE_ADAPTER_DBM_TO_INT(-17.3),
    BLE_ADAPTER_DBM_TO_INT(-16.4),
    BLE_ADAPTER_DBM_TO_INT(-15.4),
    BLE_ADAPTER_DBM_TO_INT(-14.3),
    BLE_ADAPTER_DBM_TO_INT(-13.3),
    BLE_ADAPTER_DBM_TO_INT(-12.3),
    BLE_ADAPTER_DBM_TO_INT(-11.4),
    BLE_ADAPTER_DBM_TO_INT(-10.4),
    BLE_ADAPTER_DBM_TO_INT(-9.5),
    BLE_ADAPTER_DBM_TO_INT(-8.4),
    BLE_ADAPTER_DBM_TO_INT(-7.5),
    BLE_ADAPTER_DBM_TO_INT(-6.5),
    BLE_ADAPTER_DBM_TO_INT(-5.4),
    BLE_ADAPTER_DBM_TO_INT(-4.5),
    BLE_ADAPTER_DBM_TO_INT(-3.5),
    BLE_ADAPTER_DBM_TO_INT(-2.4),
    BLE_ADAPTER_DBM_TO_INT(-1.5),
    BLE_ADAPTER_DBM_TO_INT(-0.3),
    BLE_ADAPTER_DBM_TO_INT(+0.9),
    BLE_ADAPTER_DBM_TO_INT(+2.3),
    BLE_ADAPTER_DBM_TO_INT(+2.8),
    BLE_ADAPTER_DBM_TO_INT(+3.9),
    BLE_ADAPTER_DBM_TO_INT(+4.8),
    BLE_ADAPTER_DBM_TO_INT(+5.6),
    BLE_ADAPTER_DBM_TO_INT(+6.9),
    BLE_ADAPTER_DBM_TO_INT(+7.5),
    BLE_ADAPTER_DBM_TO_INT(+8.5),
    BLE_ADAPTER_DBM_TO_INT(+10),
};

/* Private function definitions ----------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static inline const char * _ble_adapter_generic_aci_warning_display_str(const uint8_t warning_type)
{
    const char * warning_type_str;

    switch (warning_type)
    {
        case WARNING_L2CAP_RECOMBINATION_FAILURE:
            warning_type_str = "L2CAP recombination failure";
            break;

        case WARNING_GATT_UNEXPECTED_PEER_MESSAGE:
            warning_type_str = "GATT unexpected peer message";
            break;

        case WARNING_NVM_ALMOST_FULL:
            warning_type_str = "NVM almost full";
            break;

        case WARNING_COC_RX_DATA_LENGTH_TOO_LARGE:
            warning_type_str = "COC RX data length too large";
            break;

        case WARNING_COC_ALREADY_ASSIGNED_DCID:
            warning_type_str = "COC already assigned DCID";
            break;

        case WARNING_SMP_UNEXPECTED_LTK_REQUEST:
            warning_type_str = "SMP unexpected LTK request";
            break;

        case WARNING_GATT_BEARER_NOT_ALLOCATED:
            warning_type_str = "GATT bearer not allocated";

        default:
            warning_type_str = "Unknown";
            break;
    }

    return warning_type_str;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static inline const char * _ble_adapter_generic_peer_addr_type_display_str(const sid_pal_ble_ext_peer_addr_type_t addr_type, const uint8_t addr_msb)
{
    const char * addr_type_str;

    switch (addr_type)
    {
        case SPBP_PEER_ADDR_TYPE_PUBLIC:
            addr_type_str = "Public";
            break;

        case SPBP_PEER_ADDR_TYPE_RANDOM:
            if ((addr_msb & 0xC0u) == 0u)
            {
                /* As per BLE specification , the two upper bits shall be set to 00b for non-resolvable private address */
                addr_type_str = "Non-resolvable Private";
            }
            else if ((addr_msb & 0xC0u) == 0xC0u)
            {
                /* As per BLE specification , the two upper bits shall be set to 11b for static random address */
                addr_type_str = "Static Random";
            }
            else if ((addr_msb & 0xC0u) == 0x40u) /* This brach covers connections to the RPA peers before pairing is done, so RPA cannot be resolved at this stage and stack reports it as a generic random address */
            {
                /* For RPA address the upper two bits are 01b */
                addr_type_str = "RPA";
            }
            else
            {
                /* This is out of BLE spec and normally should not happen */
                addr_type_str = "Malformed Random";
            }
            break;

        case SPBP_PEER_ADDR_TYPE_RPA_PUB_ID:
        case SPBP_PEER_ADDR_TYPE_RPA_RAND_ID:
            /* This branch covers connections with known RPA peers after pairing, so RPA is resolved and recognized properly by the stack */
            addr_type_str = "RPA";
            break;

        default:
            /* Should never happen */
            addr_type_str = "Unknown";
            break;
    }

    return addr_type_str;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static inline const char * _ble_adapter_generic_phy_type_display_str(const sid_pal_ble_ext_le_phy_t phy_type)
{
    const char * phy_type_str;

    switch (phy_type)
    {
        case SPBP_LE_PHY_1M:
            phy_type_str = "1M";
            break;

        case SPBP_LE_PHY_2M:
            phy_type_str = "2M";
            break;

