stm32-hotspot/STM32-Sidewalk-SDK/pal/st/stm32wba/sid_pal/ble_adapter/sid_pal_ble_adapter_stm32wba.c
        case SPBP_LE_PHY_CODED:
            phy_type_str = "LE-Coded";
            break;

        case SPBP_LE_PHY_UNKNOWN:
        default:
            phy_type_str = "Unknown";
            break;
    }

    return phy_type_str;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static void _ble_adapter_generic_resume_flow_process(void)
{
    /* Receive any events from the LL */
    change_state_options_t notify_options = {
        .bitfield = {
            .allow_generic_event = 1u,
            .allow_acl_data      = 1u,
            .allow_iso_data      = 1u,
            .allow_reports       = 1u,
            .allow_sync_event    = 1u,
            .allow_eoa_event     = 1u,
        },
    };

    ll_intf_chng_evnt_hndlr_state(notify_options);
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static void BLE_NvmCallback(SNVMA_Callback_Status_t CbkStatus)
{
    if (CbkStatus != SNVMA_OPERATION_COMPLETE)
    {
        SNVMA_Cmd_Status_t snvma_status;

        SID_PAL_LOG_ERROR("NVM Callback 0x%02X", CbkStatus);

        /* Retry the write operation */
        snvma_status = SNVMA_Write(APP_BLE_NvmBuffer, BLE_NvmCallback);
        if (snvma_status != SNVMA_ERROR_OK)
        {
            SID_PAL_LOG_ERROR("BLE NVMA Store failed with error 0x%02X", snvma_status);
        }
    }
    else
    {
        SID_BLE_GENERIC_LOG_DEBUG("BLE NVM Store Success");
    }
}

/*----------------------------------------------------------------------------*/

#if (SID_STM32_BLE_EXTENDED_ADV_SUPPORTED == 0)
SID_STM32_SPEED_OPTIMIZED static void _ble_adapter_generic_adv_duration_timer_cb(void *arg)
{
    uint32_t adv_set_id = (uint32_t)arg;

    /**
     * The code shall be executed in the background as aci command may be sent
     * The background is the only place where the application can make sure a new aci command
     * is not sent if there is a pending one
     */
    (void)osMessageQueuePut(sid_ble_drv_ctx.advertising_cmd_queue, &adv_set_id, 0u, 0u);

    return;
}
#endif /* SID_STM32_BLE_EXTENDED_ADV_SUPPORTED */

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static inline void _gap_cmd_resp_release(const sid_pal_ble_prv_connection_ctx_t * const conn_ctx)
{
    SID_PAL_ASSERT(conn_ctx != NULL);
    SID_PAL_ASSERT(conn_ctx->gap_cmd_lock != NULL);

    (void)osSemaphoreRelease(conn_ctx->gap_cmd_lock);
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static void BleStack_Process_BG_Entry(void* thread_input)
{
    (void)(thread_input);

    while (1)
    {
        osSemaphoreAcquire(BleHostSemaphore, osWaitForever);
        BleStack_Process_BG();
    }
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static inline void BleStack_Process_BG(void)
{
    osMutexAcquire(LinkLayerMutex, osWaitForever);
    const uint32_t Running = BleStack_Process();
    osMutexRelease(LinkLayerMutex);
    if (BLE_SLEEPMODE_RUNNING == Running)
    {
        BleStackCB_Process();
    }
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static void Ble_UserEvtRx_Entry(void* thread_input)
{
    (void)(thread_input);

    while(1)
    {
        osSemaphoreAcquire(hci_async_evt_semaphore, osWaitForever);
        osMutexAcquire(LinkLayerMutex, osWaitForever);
        Ble_UserEvtRx();
        osMutexRelease(LinkLayerMutex);
    }
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static void Ble_UserEvtRx(void)
{
    SVCCTL_UserEvtFlowStatus_t svctl_return_status;
    BleEvtPacket_t *phcievt;

    LST_remove_head(&BleAsynchEventQueue, (tListNode **)&phcievt);

    svctl_return_status = SVCCTL_UserEvtRx((void *)&(phcievt->evtserial));

    if (svctl_return_status != SVCCTL_UserEvtFlowDisable)
    {
        AMM_Free((uint32_t *)phcievt);
    }
    else
    {
        LST_insert_head(&BleAsynchEventQueue, (tListNode *)phcievt);
    }

    if ((LST_is_empty(&BleAsynchEventQueue) == FALSE) && (svctl_return_status != SVCCTL_UserEvtFlowDisable))
    {
        osSemaphoreRelease(hci_async_evt_semaphore);
    }

    /* Trigger BLE Host stack to process */
    osSemaphoreRelease(BleHostSemaphore);
}

/*----------------------------------------------------------------------------*/

#if (SID_STM32_BLE_EXTENDED_ADV_SUPPORTED == 0)
SID_STM32_SPEED_OPTIMIZED static void _ble_adapter_generic_adv_cmd_task_entry(void* thread_input)
{
  (void)(thread_input);

  while(1)
  {
    osStatus_t os_status;
    uint32_t   adv_set_id;

    /* Wait for a notification from a timer */
    os_status = osMessageQueueGet(sid_ble_drv_ctx.advertising_cmd_queue, &adv_set_id, NULL, osWaitForever);

    /* Check if an advertisement set id was received successfully */
    if (os_status != osOK)
    {
        /* Skip processing and wait for the next notification */
        continue;
    }

    /* Acquire LL lock to safely process advertisement timeout */
    os_status = osMutexAcquire(LinkLayerMutex, osWaitForever);
    SID_PAL_ASSERT(osOK == os_status);

    /* Stop the advertisement since the planned duration has elapsed */
    (void)sid_stm32wba_ble_adapter_prv_generic_stop_advertisement(adv_set_id);
    /* Logs are provided by sid_stm32wba_ble_adapter_prv_generic_stop_advertisement(), in terms of the error reaction there's not so much we can do from here */

    /* Process advertisement timeout */
    if (SID_STM32_BLE_SIDEWALK_VIRT_DEV_ID == adv_set_id)
    {
        (void)sid_stm32wba_ble_adapter_sidewalk_on_adv_timeout();
        /* Logs are provided by sid_stm32wba_ble_adapter_sidewalk_on_adv_timeout(), in terms of the error reaction there's not so much we can do from here */
    }
#  if (SID_STM32_BLE_COEXISTENCE_MODE == SID_STM32_BLE_COEXISTENCE_MODE_INTERLEAVING) || (SID_STM32_BLE_COEXISTENCE_MODE == SID_STM32_BLE_COEXISTENCE_MODE_CONCURRENCY)
    else
    {
        (void)sid_stm32wba_ble_adapter_user_on_adv_timeout(adv_set_id);
        /* Logs are provided by sid_stm32wba_ble_adapter_user_on_adv_timeout(), in terms of the error reaction there's not so much we can do from here */
    }
#  endif /* SID_STM32_BLE_COEXISTENCE_MODE */

