stm32-hotspot/STM32-Sidewalk-SDK/pal/st/stm32wba/sid_pal/ble_adapter/sid_pal_ble_adapter_stm32wba.c
    (void)osMutexRelease(LinkLayerMutex);
  }
}
#endif /* SID_STM32_BLE_EXTENDED_ADV_SUPPORTED */

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static inline void _ble_adapter_generic_svc_event_handling_init(void)
{
    sid_pal_enter_critical_region();

    /* Clear the local register of handlers */
    for (uint32_t i = 0u; i < SID_STM32_UTIL_ARRAY_SIZE(sid_ble_drv_ctx.svc_event_handlers); i++)
    {
        sid_ble_drv_ctx.svc_event_handlers[i].handler = NULL;
        sid_ble_drv_ctx.svc_event_handlers[i].ref_count = 0u;
    }

    /* Register local event router */
    SVCCTL_RegisterSvcHandler(_ble_adapter_generic_svc_event_router); /* Handles SVCCTL_GATT_EVT_TYPE events only */
    SVCCTL_RegisterHandler(_ble_adapter_generic_svc_event_router);    /* Handles all the other events */

    sid_pal_exit_critical_region();
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static SVCCTL_EvtAckStatus_t _ble_adapter_generic_svc_event_router(void * p_evt)
{
    SVCCTL_EvtAckStatus_t evt_ack_status = SVCCTL_EvtNotAck;

    for (uint32_t i = 0u; i < SID_STM32_UTIL_ARRAY_SIZE(sid_ble_drv_ctx.svc_event_handlers); i++)
    {
        sid_pal_ble_prv_evt_hndlr_desc_t handler_descriptor;

        /* Store a local copy of the function pointer to avoid race conditions */
        sid_pal_enter_critical_region();
        handler_descriptor = sid_ble_drv_ctx.svc_event_handlers[i];
        sid_pal_exit_critical_region();

        if (handler_descriptor.handler != NULL)
        {
            evt_ack_status = handler_descriptor.handler(p_evt);
            if (evt_ack_status != SVCCTL_EvtNotAck)
            {
                /* One of the handlers processed the event, stop further processing */
                break;
            }
        }
    }

    return evt_ack_status;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static inline SVCCTL_UserEvtFlowStatus_t _ble_adapter_generic_process_hci_le_meta_evt(const evt_le_meta_event * const evt)
{
    SVCCTL_UserEvtFlowStatus_t evt_flow_status = SVCCTL_UserEvtFlowEnable;

    do
    {
        switch (evt->subevent)
        {
            case HCI_LE_CONNECTION_UPDATE_COMPLETE_SUBEVT_CODE:
                {
                    const hci_le_connection_update_complete_event_rp0 * const p_conn_update_complete = (hci_le_connection_update_complete_event_rp0 *)evt->data;

                    SID_BLE_GENERIC_LOG_DEBUG(">>== HCI_LE_CONNECTION_UPDATE_COMPLETE_EVENT - status: 0x%02X, conn: 0x%04X", p_conn_update_complete->Status, p_conn_update_complete->Connection_Handle);

                    if (SID_BLE_HCI_STATUS_SUCCESS == p_conn_update_complete->Status)
                    {
                        /* Locate the associated generic connection context for the connection */
                        sid_pal_ble_prv_connection_ctx_t * const conn_ctx = _ble_adapter_generic_get_conn_ctx_for_handle(p_conn_update_complete->Connection_Handle);

                        if (NULL == conn_ctx)
                        {
                            SID_PAL_LOG_ERROR("No context found for BLE connection 0x%04X", p_conn_update_complete->Connection_Handle);
                            (void)aci_gap_terminate(p_conn_update_complete->Connection_Handle, SID_BLE_HCI_STATUS_UNKNOWN_CONN_ID);
                            break;
                        }

                        /* Update stored data in the connection context */
                        sid_pal_enter_critical_region();
                        conn_ctx->public_ctx.conn_interval       = p_conn_update_complete->Conn_Interval;
                        conn_ctx->public_ctx.conn_latency        = p_conn_update_complete->Conn_Latency;
                        conn_ctx->public_ctx.supervision_timeout = p_conn_update_complete->Supervision_Timeout;
                        sid_pal_exit_critical_region();

                        SID_PAL_LOG_INFO("BLE conn params updated for handle 0x%04X, interval: %ums, latency: %u, supervision timeout: %ums",
                                         p_conn_update_complete->Connection_Handle,
                                         (uint32_t)SID_STM32_BLE_CONN_INTERVAL_UNITS_TO_MS(p_conn_update_complete->Conn_Interval),
                                         p_conn_update_complete->Conn_Latency, /* Latency is measured in link events */
                                         SID_STM32_BLE_CONN_SUPERVISION_UNITS_TO_MS(p_conn_update_complete->Supervision_Timeout)
                                        );

#if (SID_STM32_BLE_COEXISTENCE_MODE == SID_STM32_BLE_COEXISTENCE_MODE_INTERLEAVING) || (SID_STM32_BLE_COEXISTENCE_MODE == SID_STM32_BLE_COEXISTENCE_MODE_CONCURRENCY)
                        if ((NULL == sid_ble_sidewalk_ctx.conn_ctx) || (p_conn_update_complete->Connection_Handle != sid_ble_sidewalk_ctx.conn_ctx->public_ctx.conn_id))
                        {
                            sid_error_t sid_err;

                            sid_err = sid_stm32wba_ble_adapter_user_on_conn_param_changed(p_conn_update_complete->Connection_Handle);
                            if (sid_err != SID_ERROR_NONE)
                            {
                                if (SID_ERROR_NOT_FOUND == sid_err)
                                {
                                    SID_PAL_LOG_ERROR("Cannot associate BLE connection 0x%04X with Sidewalk or User Mode", p_conn_update_complete->Connection_Handle);
                                    (void)aci_gap_terminate(p_conn_update_complete->Connection_Handle, SID_BLE_HCI_STATUS_UNKNOWN_CONN_ID);
                                }
                                else
                                {
                                    SID_PAL_LOG_ERROR("BLE connection parameter update for connection 0x%04X failed. Error %d", p_conn_update_complete->Connection_Handle, (int32_t)sid_err);
                                    (void)aci_gap_terminate(p_conn_update_complete->Connection_Handle, SID_BLE_HCI_STATUS_UNACCEPTABLE_CONN_PARAMS);
                                }
                            }
                        }
                        else
#endif /* SID_STM32_BLE_COEXISTENCE_MODE */
                        {
                            sid_error_t sid_err;

                            sid_err = sid_stm32wba_ble_adapter_sidewalk_on_ble_conn_params_changed();
                            if (sid_err != SID_ERROR_NONE)
                            {
                                SID_PAL_LOG_ERROR("BLE connection parameter update for Sidewalk failed. Error %d", (int32_t)sid_err);
                                (void)aci_gap_terminate(p_conn_update_complete->Connection_Handle, SID_BLE_HCI_STATUS_UNACCEPTABLE_CONN_PARAMS);
                            }
                        }
                    }
                    else
                    {
                        SID_PAL_LOG_ERROR("BLE connection parameter update failed. Status: 0x%02X, conn: 0x%04X", p_conn_update_complete->Status, p_conn_update_complete->Connection_Handle);
                    }
                }
                break;

            case HCI_LE_REMOTE_CONNECTION_PARAMETER_REQUEST_SUBEVT_CODE:
                {
                    const hci_le_remote_connection_parameter_request_event_rp0 * const p_remote_connection_parameter_request = (hci_le_remote_connection_parameter_request_event_rp0 *)evt->data;
                    sid_ble_ext_proposed_conn_params_t proposed_params;
                    sid_ble_ext_accepted_conn_params_t accepted_params;
                    tBleStatus reason, ble_status;

                    SID_BLE_GENERIC_LOG_DEBUG(">>== HCI_LE_REMOTE_CONNECTION_PARAMETER_REQUEST_EVENT- conn: 0x%04X", p_remote_connection_parameter_request->Connection_Handle);

                    /* Locate the associated generic connection context for the connection */
                     sid_pal_ble_prv_connection_ctx_t * const conn_ctx = _ble_adapter_generic_get_conn_ctx_for_handle(p_remote_connection_parameter_request->Connection_Handle);

                    if (NULL == conn_ctx)
                    {
                        SID_PAL_LOG_ERROR("No context found for BLE connection 0x%04X", p_remote_connection_parameter_request->Connection_Handle);
                        (void)aci_gap_terminate(p_remote_connection_parameter_request->Connection_Handle, SID_BLE_HCI_STATUS_UNKNOWN_CONN_ID);
                        break;
                    }

                    proposed_params.interval_min = p_remote_connection_parameter_request->Interval_Min;
                    proposed_params.interval_max = p_remote_connection_parameter_request->Interval_Max;
                    proposed_params.latency_max  = p_remote_connection_parameter_request->Max_Latency;
                    proposed_params.timeout      = p_remote_connection_parameter_request->Timeout;

                    SID_PAL_LOG_INFO("BLE conn params update request for handle 0x%04X, interval min: %ums, interval max: %ums, latency max: %u, timeout: %ums",
                                     p_remote_connection_parameter_request->Connection_Handle,
                                     (uint32_t)SID_STM32_BLE_CONN_INTERVAL_UNITS_TO_MS(proposed_params.interval_min),
                                     (uint32_t)SID_STM32_BLE_CONN_INTERVAL_UNITS_TO_MS(proposed_params.interval_max),
                                     proposed_params.latency_max, /* Latency is measured in link events */
                                     SID_STM32_BLE_CONN_SUPERVISION_UNITS_TO_MS(proposed_params.timeout)
                                    );

#if (SID_STM32_BLE_COEXISTENCE_MODE == SID_STM32_BLE_COEXISTENCE_MODE_INTERLEAVING) || (SID_STM32_BLE_COEXISTENCE_MODE == SID_STM32_BLE_COEXISTENCE_MODE_CONCURRENCY)
                    if ((NULL == sid_ble_sidewalk_ctx.conn_ctx) || (p_remote_connection_parameter_request->Connection_Handle != sid_ble_sidewalk_ctx.conn_ctx->public_ctx.conn_id))
                    {
                        sid_error_t sid_err;

