stm32-hotspot/STM32-Sidewalk-SDK/pal/st/stm32wba/sid_pal/ble_adapter/sid_pal_ble_adapter_stm32wba.c
                        sid_err = sid_stm32wba_ble_adapter_user_on_conn_params_update_req(p_remote_connection_parameter_request->Connection_Handle, &proposed_params, &accepted_params, &reason);
                        if (sid_err != SID_ERROR_NONE)
                        {
                            if (SID_ERROR_NOT_FOUND == sid_err)
                            {
                                SID_PAL_LOG_ERROR("Cannot associate BLE connection 0x%04X with Sidewalk or User Mode", p_remote_connection_parameter_request->Connection_Handle);
                                (void)aci_gap_terminate(p_remote_connection_parameter_request->Connection_Handle, SID_BLE_HCI_STATUS_UNKNOWN_CONN_ID);
                                break;
                            }
                            else
                            {
                                SID_PAL_LOG_ERROR("BLE connection parameter update request for connection 0x%04X failed. Error %d", p_remote_connection_parameter_request->Connection_Handle, (int32_t)sid_err);
                                (void)aci_gap_terminate(p_remote_connection_parameter_request->Connection_Handle, SID_BLE_HCI_STATUS_UNACCEPTABLE_CONN_PARAMS);
                                break;
                            }
                        }
                    }
                    else
#endif /* SID_STM32_BLE_COEXISTENCE_MODE */
                    {
                        sid_error_t sid_err;

                        sid_err = sid_stm32wba_ble_adapter_sidewalk_on_ble_conn_params_update_req(&proposed_params, &accepted_params, &reason);
                        if (sid_err != SID_ERROR_NONE)
                        {
                            SID_PAL_LOG_ERROR("BLE connection parameter update request for Sidewalk failed. Error %d", (int32_t)sid_err);
                            (void)aci_gap_terminate(p_remote_connection_parameter_request->Connection_Handle, SID_BLE_HCI_STATUS_UNACCEPTABLE_CONN_PARAMS);
                            break;
                        }
                    }

                    if (BLE_STATUS_SUCCESS == reason)
                    {
                        ble_status = hci_le_remote_connection_parameter_request_reply(p_remote_connection_parameter_request->Connection_Handle,
                                                                                      accepted_params.interval_min,
                                                                                      accepted_params.interval_max,
                                                                                      accepted_params.latency_max,
                                                                                      accepted_params.timeout,
                                                                                      accepted_params.ce_length_min,
                                                                                      accepted_params.ce_length_max);
                    }
                    else
                    {
                        ble_status = hci_le_remote_connection_parameter_request_negative_reply(p_remote_connection_parameter_request->Connection_Handle, reason);
                    }

                    if (ble_status != BLE_STATUS_SUCCESS)
                    {
                        SID_PAL_LOG_ERROR("Failed to respond to BLE connection parameter update request for handle 0x%04X, status 0x%02X", p_remote_connection_parameter_request->Connection_Handle, ble_status);
                        (void)aci_gap_terminate(p_remote_connection_parameter_request->Connection_Handle, SID_BLE_HCI_STATUS_UNACCEPTABLE_CONN_PARAMS);
                    }
                }
                break;

            case HCI_LE_PHY_UPDATE_COMPLETE_SUBEVT_CODE:
                {
                    const hci_le_phy_update_complete_event_rp0 * const p_phy_update_complete = (hci_le_phy_update_complete_event_rp0 *)evt->data;

                    SID_BLE_GENERIC_LOG_DEBUG(">>== HCI_LE_PHY_UPDATE_COMPLETE_EVENT - status: 0x%02X, conn: 0x%04X, tx_phy: 0x%1X, rx_phy: 0x%1X",
                                      p_phy_update_complete->Status,
                                      p_phy_update_complete->Connection_Handle,
                                      p_phy_update_complete->TX_PHY,
                                      p_phy_update_complete->RX_PHY
                    );

                    sid_pal_ble_prv_connection_ctx_t * const conn_ctx = _ble_adapter_generic_get_conn_ctx_for_handle(p_phy_update_complete->Connection_Handle);
                    if (conn_ctx != NULL)
                    {
                        static_assert(SPBP_LE_PHY_1M    == HCI_RX_PHY_LE_1M);
                        static_assert(SPBP_LE_PHY_2M    == HCI_RX_PHY_LE_2M);
                        static_assert(SPBP_LE_PHY_CODED == HCI_RX_PHY_LE_CODED);
                        static_assert(SPBP_LE_PHY_1M    == HCI_TX_PHY_LE_1M);
                        static_assert(SPBP_LE_PHY_2M    == HCI_TX_PHY_LE_2M);
                        static_assert(SPBP_LE_PHY_CODED == HCI_TX_PHY_LE_CODED);

                        if (SID_BLE_HCI_STATUS_SUCCESS == p_phy_update_complete->Status)
                        {
                            conn_ctx->public_ctx.tx_phy = (sid_pal_ble_ext_le_phy_t)p_phy_update_complete->TX_PHY;
                            conn_ctx->public_ctx.rx_phy = (sid_pal_ble_ext_le_phy_t)p_phy_update_complete->RX_PHY;

                            SID_PAL_LOG_INFO("PHY updated for BLE connection 0x%04X, Tx PHY: %s, Rx PHY: %s",
                                             conn_ctx->public_ctx.conn_id,
                                             _ble_adapter_generic_phy_type_display_str(conn_ctx->public_ctx.tx_phy),
                                             _ble_adapter_generic_phy_type_display_str(conn_ctx->public_ctx.rx_phy));
                        }
                        _gap_cmd_resp_release(conn_ctx);
                    }
                }
                break;

#if SID_STM32_BLE_EXTENDED_ADV_SUPPORTED
            case HCI_LE_ADVERTISING_SET_TERMINATED_SUBEVT_CODE:
                {
                    const hci_le_advertising_set_terminated_event_rp0 * const p_advertising_set_terminated = (hci_le_advertising_set_terminated_event_rp0 *)evt->data;

