stm32-hotspot/STM32-Sidewalk-SDK/pal/st/stm32wba/sid_pal/ble_adapter/sid_pal_ble_adapter_stm32wba.c
                    SID_BLE_GENERIC_LOG_DEBUG(">>== HCI_LE_ADVERTISING_SET_TERMINATED_EVENT - set: 0x%02X, status: 0x%02X, conn handle: 0x%04X",
                                      p_advertising_set_terminated->Advertising_Handle,
                                      p_advertising_set_terminated->Status,
                                      (SID_BLE_HCI_STATUS_SUCCESS == p_advertising_set_terminated->Status) ? p_advertising_set_terminated->Connection_Handle : SID_STM32_BLE_HANDLE_INVALID_VALUE);

                    /* If the advertisement resulted in a connection */
                    if (SID_BLE_HCI_STATUS_SUCCESS == p_advertising_set_terminated->Status)
                    {
                        sid_error_t sid_err;

                        /* Locate the associated generic connection context for the connection */
                        sid_pal_ble_prv_connection_ctx_t * const conn_ctx = _ble_adapter_generic_get_conn_ctx_for_handle(p_advertising_set_terminated->Connection_Handle);

                        if (NULL == conn_ctx)
                        {
                            SID_PAL_LOG_ERROR("No context found for BLE connection 0x%04X", p_advertising_set_terminated->Connection_Handle);
                            (void)aci_gap_terminate(p_advertising_set_terminated->Connection_Handle, SID_BLE_HCI_STATUS_UNKNOWN_CONN_ID);
                            break;
                        }

                        /* Store the related advertising handle */
                        conn_ctx->adv_set_id = p_advertising_set_terminated->Advertising_Handle;

                        /* Process Sidewalk-related event */
                        if (p_advertising_set_terminated->Advertising_Handle == sid_ble_sidewalk_ctx.adv_set.Advertising_Handle)
                        {
                            /* This connection comes from the advertisement set associated with Sidewalk advertisement - start Sidewalk link */
                            sid_err = sid_stm32wba_ble_adapter_sidewalk_on_ble_connected(conn_ctx);
                        }
                        else
                        {
                            /* Established a user mode connection with a Central peer */
                            sid_err = sid_stm32wba_ble_adapter_user_on_ble_connected_to_central(p_advertising_set_terminated->Advertising_Handle, conn_ctx);
                        }

                        if (sid_err != SID_ERROR_NONE)
                        {
                            /* Something went wrong during connection completion (e.g. user-mode part of the driver refused to accept the connection) */
                            SID_PAL_LOG_ERROR("Can't accept BLE connection with @:%02x:%02x:%02x:%02x:%02x:%02x",
                                              conn_ctx->public_ctx.peer_identity[5],
                                              conn_ctx->public_ctx.peer_identity[4],
                                              conn_ctx->public_ctx.peer_identity[3],
                                              conn_ctx->public_ctx.peer_identity[2],
                                              conn_ctx->public_ctx.peer_identity[1],
                                              conn_ctx->public_ctx.peer_identity[0]);
                            (void)aci_gap_terminate(p_advertising_set_terminated->Connection_Handle, SID_BLE_HCI_STATUS_REMOTE_SIDE_TERMINATED);
                            break;
                        }
                    }
                    else if (SID_BLE_HCI_STATUS_ADV_TIMEOUT == p_advertising_set_terminated->Status)
                    {
                        /* Advertisement set was terminated due to timeout - restart if needed */
                        if (p_advertising_set_terminated->Advertising_Handle == sid_ble_sidewalk_ctx.adv_set.Advertising_Handle)
                        {
                            (void)sid_stm32wba_ble_adapter_sidewalk_on_adv_timeout();
                        }
                        else
                        {
                            (void)sid_stm32wba_ble_adapter_user_on_adv_timeout(p_advertising_set_terminated->Advertising_Handle);
                        }
                    }
                    else
                    {
                        SID_PAL_LOG_ERROR("BLE advertisement terminated with error. Set: 0x%02X, status: %02X", p_advertising_set_terminated->Advertising_Handle, p_advertising_set_terminated->Status);
                    }
                }
                break;
#endif /* SID_STM32_BLE_EXTENDED_ADV_SUPPORTED */

            case HCI_LE_ENHANCED_CONNECTION_COMPLETE_SUBEVT_CODE:
                {
                    const hci_le_enhanced_connection_complete_event_rp0 * const p_enhanced_conn_complete = (hci_le_enhanced_connection_complete_event_rp0 *)evt->data;

                    SID_BLE_GENERIC_LOG_DEBUG(">>== HCI_LE_ENHANCED_CONNECTION_COMPLETE_EVENT - Status: 0x%02X, Connection handle: 0x%04X", p_enhanced_conn_complete->Status, p_enhanced_conn_complete->Connection_Handle);

                    /* Run in a critical section because we are about to setup connection context */
                    sid_pal_enter_critical_region();

                    if (p_enhanced_conn_complete->Status != SID_BLE_HCI_STATUS_SUCCESS)
                    {
                        /* Connection attempt failed - ignore it and restart advertisement */
#if (SID_STM32_BLE_EXTENDED_ADV_SUPPORTED == 0)
                        /* Restart the advertisement automatically. Duration timer is still running if it was armed */
                        tBleStatus ble_status = hci_le_set_advertising_enable(SID_BLE_HCI_SET_ADV_ENABLE);
                        if (ble_status != BLE_STATUS_SUCCESS)
                        {
                            SID_PAL_LOG_ERROR("==>> hci_le_set_advertising_enable - fail, result: 0x%02X", ble_status);
                        }
                        else
                        {
                            SID_PAL_LOG_DEBUG("==>> hci_le_set_advertising_enable - Success");
                        }
#endif /* SID_STM32_BLE_EXTENDED_ADV_SUPPORTED */
                        sid_pal_exit_critical_region();
                        break;
                    }

                    /* Create generic connection context for further connection management */
                    sid_pal_ble_prv_connection_ctx_t * const conn_ctx = _ble_adapter_generic_get_free_conn_ctx(p_enhanced_conn_complete->Connection_Handle);

