stm32-hotspot/STM32-Sidewalk-SDK/pal/st/stm32wba/sid_pal/ble_adapter/sid_pal_ble_adapter_stm32wba.c
                    /* Check if we are not out of resources */
                    if (NULL == conn_ctx)
                    {
                        SID_PAL_LOG_WARNING("Cannot accept BLE connection - no slots for ctx storage");
                        (void)aci_gap_terminate(p_enhanced_conn_complete->Connection_Handle, SID_BLE_HCI_STATUS_CONN_LIMIT_EXCEEDED);
                        sid_pal_exit_critical_region();
                        break;
                    }

#if (SID_STM32_BLE_EXTENDED_ADV_SUPPORTED == 0)
                    /* Stop the related advertisement timer */
                    (void)UTIL_TIMER_Stop(&sid_ble_drv_ctx.adv_timer);
#endif /* SID_STM32_BLE_EXTENDED_ADV_SUPPORTED */

                    /* Populate connection context */
                    /* conn_ctx->public_ctx.conn_id is set already by _ble_adapter_generic_get_free_conn_ctx() */
                    /* conn_ctx->adv_set_id will be set in HCI_LE_ADVERTISING_SET_TERMINATED (if relevant) */
                    conn_ctx->public_ctx.is_secure           = FALSE;
                    conn_ctx->public_ctx.mtu_size            = SID_BLE_HCI_DEFAULT_ATT_MTU;         /* Initial MTU size is mandated by the Core Specification - 23 bytes */
                    conn_ctx->public_ctx.max_mtu_size        = sid_ble_drv_ctx.global_att_mtu_size; /* Maximum acceptable MTU by the controller */
                    conn_ctx->role                           = p_enhanced_conn_complete->Role;
                    conn_ctx->public_ctx.peer_addr_type      = p_enhanced_conn_complete->Peer_Address_Type;
                    conn_ctx->public_ctx.conn_interval       = p_enhanced_conn_complete->Conn_Interval;
                    conn_ctx->public_ctx.conn_latency        = p_enhanced_conn_complete->Conn_Latency;
                    conn_ctx->public_ctx.supervision_timeout = p_enhanced_conn_complete->Supervision_Timeout;
                    SID_STM32_UTIL_fast_memcpy(conn_ctx->public_ctx.peer_identity, p_enhanced_conn_complete->Peer_Address,                     sizeof(conn_ctx->public_ctx.peer_identity));
                    SID_STM32_UTIL_fast_memcpy(conn_ctx->public_ctx.local_rpa,     p_enhanced_conn_complete->Local_Resolvable_Private_Address, sizeof(conn_ctx->public_ctx.local_rpa));
                    SID_STM32_UTIL_fast_memcpy(conn_ctx->public_ctx.peer_rpa,      p_enhanced_conn_complete->Peer_Resolvable_Private_Address,  sizeof(conn_ctx->public_ctx.peer_rpa));

                    /* Get information about the initially used PHYs for Tx and Rx for this connection */
                    uint8_t tx_phy = (uint8_t)SPBP_LE_PHY_UNKNOWN;
                    uint8_t rx_phy = (uint8_t)SPBP_LE_PHY_UNKNOWN;
                    (void)hci_le_read_phy(p_enhanced_conn_complete->Connection_Handle, &tx_phy, &rx_phy);
                    conn_ctx->public_ctx.tx_phy = (sid_pal_ble_ext_le_phy_t)tx_phy;
                    conn_ctx->public_ctx.rx_phy = (sid_pal_ble_ext_le_phy_t)rx_phy;

                    sid_pal_exit_critical_region();

                    /* Log connection info */
                    if (p_enhanced_conn_complete->Peer_Address_Type < SID_BLE_HCI_ADV_PEER_ADDR_TYPE_RPA_PUBLIC_IDENTITY)
                    {
                        /* Non-resolvable address (e.g. public, static random, or NRPA) */
                        SID_PAL_LOG_INFO("Established BLE connection (0x%04X) with %02X:%02X:%02X:%02X:%02X:%02X (%s addr), Tx PHY: %s, Rx PHY: %s",
                                         p_enhanced_conn_complete->Connection_Handle,
                                         p_enhanced_conn_complete->Peer_Address[5],
                                         p_enhanced_conn_complete->Peer_Address[4],
                                         p_enhanced_conn_complete->Peer_Address[3],
                                         p_enhanced_conn_complete->Peer_Address[2],
                                         p_enhanced_conn_complete->Peer_Address[1],
                                         p_enhanced_conn_complete->Peer_Address[0],
                                         _ble_adapter_generic_peer_addr_type_display_str(p_enhanced_conn_complete->Peer_Address_Type, p_enhanced_conn_complete->Peer_Address[5]),
                                         _ble_adapter_generic_phy_type_display_str(conn_ctx->public_ctx.tx_phy),
                                         _ble_adapter_generic_phy_type_display_str(conn_ctx->public_ctx.rx_phy));
                    }
                    else
                    {
                        /* Resolvable address - print RPA and related resolved identity address */
                        SID_PAL_LOG_INFO("Established BLE connection (0x%04X) with %02X:%02X:%02X:%02X:%02X:%02X (RPA, resolved to %02X:%02X:%02X:%02X:%02X:%02X), PHY: %s, Rx PHY: %s",
                                         p_enhanced_conn_complete->Connection_Handle,
                                         p_enhanced_conn_complete->Peer_Resolvable_Private_Address[5],
                                         p_enhanced_conn_complete->Peer_Resolvable_Private_Address[4],
                                         p_enhanced_conn_complete->Peer_Resolvable_Private_Address[3],
                                         p_enhanced_conn_complete->Peer_Resolvable_Private_Address[2],
                                         p_enhanced_conn_complete->Peer_Resolvable_Private_Address[1],
                                         p_enhanced_conn_complete->Peer_Resolvable_Private_Address[0],
                                         p_enhanced_conn_complete->Peer_Address[5],
                                         p_enhanced_conn_complete->Peer_Address[4],
                                         p_enhanced_conn_complete->Peer_Address[3],
                                         p_enhanced_conn_complete->Peer_Address[2],
                                         p_enhanced_conn_complete->Peer_Address[1],
                                         p_enhanced_conn_complete->Peer_Address[0],
                                         _ble_adapter_generic_phy_type_display_str(conn_ctx->public_ctx.tx_phy),
                                         _ble_adapter_generic_phy_type_display_str(conn_ctx->public_ctx.rx_phy));
                    }
                    SID_PAL_LOG_INFO("BLE conn params for handle 0x%04X: interval: %ums, latency: %u, supervision timeout: %ums",
                                     p_enhanced_conn_complete->Connection_Handle,
                                     (uint32_t)SID_STM32_BLE_CONN_INTERVAL_UNITS_TO_MS(p_enhanced_conn_complete->Conn_Interval),
                                     p_enhanced_conn_complete->Conn_Latency, /* Latency is measured in link events */
                                     (uint32_t)SID_STM32_BLE_CONN_SUPERVISION_UNITS_TO_MS(p_enhanced_conn_complete->Supervision_Timeout)
                                    );

#if SID_STM32_BLE_EXTENDED_ADV_SUPPORTED
                    /* If extended advertisement is supported the processing will continue in HCI_LE_ADVERTISING_SET_TERMINATED event to decide if this connection belongs to Sidewalk or user domain */
#else
                    sid_error_t sid_err;
                    if ((SPBP_OPERATING_MODE_SIDEWALK == sid_ble_drv_ctx.operating_mode) && (SID_BLE_HCI_CONN_COMPLETE_ROLE_PERIPHERAL == p_enhanced_conn_complete->Role))
                    {
                        /* Driver is in the Sidewalk mode, treat this connection as Sidewalk connection */
                        sid_err = sid_stm32wba_ble_adapter_sidewalk_on_ble_connected(conn_ctx);
                    }
#  if (SID_STM32_BLE_COEXISTENCE_MODE == SID_STM32_BLE_COEXISTENCE_MODE_INTERLEAVING)
                    else if (SPBP_OPERATING_MODE_USER == sid_ble_drv_ctx.operating_mode)
                    {
                        /* Driver is in the User BLE mode, treat this connection as user connection */
                        if (SID_BLE_HCI_CONN_COMPLETE_ROLE_PERIPHERAL == p_enhanced_conn_complete->Role)
                        {
                            /* Established a user mode connection with a Central peer */
                            sid_err = sid_stm32wba_ble_adapter_user_on_ble_connected_to_central(SID_STM32_BLE_VIRTUAL_DEVICE_ID_INVALID, conn_ctx);
                        }
                        else
                        {
                            /* Established a user mode connection with a Peripheral peer */
                            sid_err = sid_stm32wba_ble_adapter_user_on_ble_connected_to_peripheral(conn_ctx);
                        }
                    }
#  endif /* SID_STM32_BLE_COEXISTENCE_MODE */
                    else
                    {
                        /* Normally we shouldn't get here - there's a mismatch between the logical state of the driver and the actual events */
                        SID_PAL_LOG_ERROR("Inconsistent BLE driver state. Operating mode: %u, coexistence mode: %u", sid_ble_drv_ctx.operating_mode, SID_STM32_BLE_COEXISTENCE_MODE);
                        (void)aci_gap_terminate(p_enhanced_conn_complete->Connection_Handle, SID_BLE_HCI_STATUS_REMOTE_SIDE_TERMINATED);
                        break;
                    }

                    if (sid_err != SID_ERROR_NONE)
                    {
                        /* Something went wrong during connection completion (e.g. user-mode part of the driver refused to accept the connection) */
                        SID_PAL_LOG_DEBUG("Can't accept BLE connection with @:%02x:%02x:%02x:%02x:%02x:%02x",
                                          conn_ctx->public_ctx.peer_identity[5],
                                          conn_ctx->public_ctx.peer_identity[4],
                                          conn_ctx->public_ctx.peer_identity[3],
                                          conn_ctx->public_ctx.peer_identity[2],
                                          conn_ctx->public_ctx.peer_identity[1],
                                          conn_ctx->public_ctx.peer_identity[0]);
                        (void)aci_gap_terminate(p_enhanced_conn_complete->Connection_Handle, SID_BLE_HCI_STATUS_REMOTE_SIDE_TERMINATED);
                        break;
                    }
#endif /* SID_STM32_BLE_EXTENDED_ADV_SUPPORTED */
                }
                break;

            default:
                /* Do nothing, allow the event flow to continue */
                break;
        }
    } while (0);

