stm32-hotspot/STM32-Sidewalk-SDK/pal/st/stm32wba/sid_pal/ble_adapter/sid_pal_ble_adapter_stm32wba.c
    return evt_flow_status;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static inline SVCCTL_UserEvtFlowStatus_t _ble_adapter_generic_process_aci_evt(const evt_blecore_aci * const evt)
{
    SVCCTL_UserEvtFlowStatus_t evt_flow_status = SVCCTL_UserEvtFlowEnable;
    tBleStatus                 ret;

    do
    {
        switch (evt->ecode)
        {
            case ACI_L2CAP_CONNECTION_UPDATE_RESP_VSEVT_CODE:
                {
                    const aci_l2cap_connection_update_resp_event_rp0 * const p_l2cap_conn_update_resp = (aci_l2cap_connection_update_resp_event_rp0 *)evt->data;
                    UNUSED(p_l2cap_conn_update_resp);
                    /* USER CODE BEGIN EVT_L2CAP_CONNECTION_UPDATE_RESP */

                    /* USER CODE END EVT_L2CAP_CONNECTION_UPDATE_RESP */
                }
                break;

            case ACI_GAP_PROC_COMPLETE_VSEVT_CODE:
                {
                    SID_BLE_GENERIC_LOG_DEBUG(">>== ACI_GAP_PROC_COMPLETE_EVENT");
                    const aci_gap_proc_complete_event_rp0 * const p_gap_proc_complete = (aci_gap_proc_complete_event_rp0 *)evt->data;
                    UNUSED(p_gap_proc_complete);
                    /* USER CODE BEGIN EVT_GAP_PROCEDURE_COMPLETE */

                    /* USER CODE END EVT_GAP_PROCEDURE_COMPLETE */
                }
                break;

            case ACI_GAP_KEYPRESS_NOTIFICATION_VSEVT_CODE:
                {
                    SID_BLE_GENERIC_LOG_DEBUG(">>== ACI_GAP_KEYPRESS_NOTIFICATION_EVENT");
                    const aci_gap_keypress_notification_event_rp0 * const p_keypress_notification = (aci_gap_keypress_notification_event_rp0 *)evt->data;

#if (SID_STM32_BLE_COEXISTENCE_MODE == SID_STM32_BLE_COEXISTENCE_MODE_INTERLEAVING) || (SID_STM32_BLE_COEXISTENCE_MODE == SID_STM32_BLE_COEXISTENCE_MODE_CONCURRENCY)
                    /* Notify the respective GATT processors */
                    if ((NULL == sid_ble_sidewalk_ctx.conn_ctx) || (p_keypress_notification->Connection_Handle != sid_ble_sidewalk_ctx.conn_ctx->public_ctx.conn_id))
                    {
                        (void)sid_stm32wba_ble_adapter_user_on_pairing_keypress_notification(p_keypress_notification->Connection_Handle, p_keypress_notification->Notification_Type);
                    }
#else
                    (void)p_keypress_notification;
#endif /* SID_STM32_BLE_COEXISTENCE_MODE */
                }
                break;

            case ACI_GAP_PASS_KEY_REQ_VSEVT_CODE:
                {
                    SID_BLE_GENERIC_LOG_DEBUG(">>== ACI_GAP_PASS_KEY_REQ_EVENT");
                    const aci_gap_pass_key_req_event_rp0 * const p_pass_key_req = (aci_gap_pass_key_req_event_rp0 *)evt->data;
                    sid_error_t sid_err;

#if (SID_STM32_BLE_COEXISTENCE_MODE == SID_STM32_BLE_COEXISTENCE_MODE_INTERLEAVING) || (SID_STM32_BLE_COEXISTENCE_MODE == SID_STM32_BLE_COEXISTENCE_MODE_CONCURRENCY)
                    /* Notify the respective GATT processors */
                    if ((NULL == sid_ble_sidewalk_ctx.conn_ctx) || (p_pass_key_req->Connection_Handle != sid_ble_sidewalk_ctx.conn_ctx->public_ctx.conn_id))
                    {
                        uint32_t passkey;

                        sid_err = sid_stm32wba_ble_adapter_user_on_pairing_pass_key_request(p_pass_key_req->Connection_Handle, &passkey);

                        if (SID_ERROR_NONE == sid_err)
                        {
                            ret = aci_gap_pass_key_resp(p_pass_key_req->Connection_Handle, passkey);
                            if (ret != BLE_STATUS_SUCCESS)
                            {
                                SID_BLE_GENERIC_LOG_ERROR("==>> aci_gap_pass_key_resp : Fail, reason: 0x%02X", ret);
                            }
                            else
                            {
                                SID_BLE_GENERIC_LOG_DEBUG("==>> aci_gap_pass_key_resp : Success");
                            }
                        }
                    }
                    else
#endif /* SID_STM32_BLE_COEXISTENCE_MODE */
                    {
                        sid_err = SID_ERROR_NO_PERMISSION;
                    }

                    if (sid_err != SID_ERROR_NONE)
                    {
                        (void)aci_gap_terminate(p_pass_key_req->Connection_Handle, SID_BLE_HCI_STATUS_PAIRING_NOT_ALLOWED);
                    }
                }
                break;

            case ACI_GAP_NUMERIC_COMPARISON_VALUE_VSEVT_CODE:
                {
                    SID_BLE_GENERIC_LOG_DEBUG(">>== ACI_GAP_NUMERIC_COMPARISON_VALUE_EVENT");
                    const aci_gap_numeric_comparison_value_event_rp0 * const p_numeric_comparison_value = (aci_gap_numeric_comparison_value_event_rp0 *)evt->data;
                    sid_error_t sid_err;

                    SID_BLE_GENERIC_LOG_DEBUG("     - numeric_value = %ld", p_numeric_comparison_value->Numeric_Value);
                    SID_BLE_GENERIC_LOG_DEBUG("     - Hex_value = %lx",p_numeric_comparison_value->Numeric_Value);

#if (SID_STM32_BLE_COEXISTENCE_MODE == SID_STM32_BLE_COEXISTENCE_MODE_INTERLEAVING) || (SID_STM32_BLE_COEXISTENCE_MODE == SID_STM32_BLE_COEXISTENCE_MODE_CONCURRENCY)
                    /* Notify the respective GATT processors */
                    if ((NULL == sid_ble_sidewalk_ctx.conn_ctx) || (p_numeric_comparison_value->Connection_Handle != sid_ble_sidewalk_ctx.conn_ctx->public_ctx.conn_id))
                    {
                        uint32_t numeric_value_matches;

                        sid_err = sid_stm32wba_ble_adapter_user_on_pairing_numeric_comparison_value(p_numeric_comparison_value->Connection_Handle, p_numeric_comparison_value->Numeric_Value, &numeric_value_matches);
                        if (SID_ERROR_NONE == sid_err)
                        {
                            ret = aci_gap_numeric_comparison_value_confirm_yesno(p_numeric_comparison_value->Connection_Handle, numeric_value_matches != FALSE ? NUMERIC_COMPARISON_CONFIRM_YES : NUMERIC_COMPARISON_CONFIRM_NO);
                            if (ret != BLE_STATUS_SUCCESS)
                            {
                                SID_BLE_GENERIC_LOG_ERROR("==>> aci_gap_numeric_comparison_value_confirm_yesno-->YES : Fail, reason: 0x%02X", ret);
                            }
                            else
                            {
                                SID_BLE_GENERIC_LOG_DEBUG("==>> aci_gap_numeric_comparison_value_confirm_yesno-->YES : Success");
                            }
                        }
                    }
                    else
#endif /* SID_STM32_BLE_COEXISTENCE_MODE */
                    {
                        sid_err = SID_ERROR_NO_PERMISSION;
                    }

                    if (sid_err != SID_ERROR_NONE)
                    {
                        (void)aci_gap_terminate(p_numeric_comparison_value->Connection_Handle, SID_BLE_HCI_STATUS_PAIRING_NOT_ALLOWED);
                    }
                }
                break;

            case ACI_GAP_PAIRING_COMPLETE_VSEVT_CODE:
                {
                    SID_BLE_GENERIC_LOG_DEBUG(">>== ACI_GAP_PAIRING_COMPLETE_EVENT");
                    const aci_gap_pairing_complete_event_rp0 * const p_pairing_complete = (aci_gap_pairing_complete_event_rp0*)evt->data;
                    sid_error_t sid_err;

                    /* Update connection context if IRKs were exchanged */
                    if (BLE_STATUS_SUCCESS == p_pairing_complete->Status)
                    {
                        sid_pal_ble_prv_connection_ctx_t * const conn_ctx = _ble_adapter_generic_get_conn_ctx_for_handle(p_pairing_complete->Connection_Handle);
                        if ((conn_ctx != NULL) && (SID_BLE_HCI_ADV_PEER_ADDR_TYPE_RANDOM == conn_ctx->public_ctx.peer_addr_type) && ((conn_ctx->public_ctx.peer_identity[5] & SID_STM32_BLE_PRV_RANDOM_ADDR_SPECIFIER_MASK) == SID_STM32_BLE_PRV_RANDOM_ADDR_TYPE_RPA_MASK))
                        {
                            /* Move random address to RPA storage */
                            SID_STM32_UTIL_fast_memcpy(conn_ctx->public_ctx.peer_rpa, conn_ctx->public_ctx.peer_identity, sizeof(conn_ctx->public_ctx.peer_rpa));

                            /* Resolve address and update peer_identity storage */
                            ret = aci_gap_check_bonded_device(conn_ctx->public_ctx.peer_addr_type, conn_ctx->public_ctx.peer_rpa, &conn_ctx->public_ctx.peer_addr_type, conn_ctx->public_ctx.peer_identity);

