stm32-hotspot/STM32-Sidewalk-SDK/pal/st/stm32wba/sid_pal/ble_adapter/sid_pal_ble_adapter_stm32wba.c
                            /* Revert to SID_BLE_HCI_ADV_PEER_ADDR_TYPE_RANDOM as we cannot resolve the address or bonding was not performed */
                            if (ret != BLE_STATUS_SUCCESS)
                            {
                                SID_STM32_UTIL_fast_memcpy(conn_ctx->public_ctx.peer_identity, conn_ctx->public_ctx.peer_rpa, sizeof(conn_ctx->public_ctx.peer_identity));
                                SID_STM32_UTIL_fast_memset(conn_ctx->public_ctx.peer_rpa, 0u, sizeof(conn_ctx->public_ctx.peer_rpa));
                            }
                            else
                            {
                                /* Resolvable address - print RPA and related resolved identity address */
                                SID_PAL_LOG_INFO("BLE connection (0x%04X) RPA configured: %02X:%02X:%02X:%02X:%02X:%02X (%02X:%02X:%02X:%02X:%02X:%02X), addr type 0x%02X",
                                                 p_pairing_complete->Connection_Handle,
                                                 conn_ctx->public_ctx.peer_rpa[5],
                                                 conn_ctx->public_ctx.peer_rpa[4],
                                                 conn_ctx->public_ctx.peer_rpa[3],
                                                 conn_ctx->public_ctx.peer_rpa[2],
                                                 conn_ctx->public_ctx.peer_rpa[1],
                                                 conn_ctx->public_ctx.peer_rpa[0],
                                                 conn_ctx->public_ctx.peer_identity[5],
                                                 conn_ctx->public_ctx.peer_identity[4],
                                                 conn_ctx->public_ctx.peer_identity[3],
                                                 conn_ctx->public_ctx.peer_identity[2],
                                                 conn_ctx->public_ctx.peer_identity[1],
                                                 conn_ctx->public_ctx.peer_identity[0],
                                                 conn_ctx->public_ctx.peer_addr_type);
                            }
                        }
                    }

#if (SID_STM32_BLE_COEXISTENCE_MODE == SID_STM32_BLE_COEXISTENCE_MODE_INTERLEAVING) || (SID_STM32_BLE_COEXISTENCE_MODE == SID_STM32_BLE_COEXISTENCE_MODE_CONCURRENCY)
                    /* Notify the respective GATT processors */
                    if ((NULL == sid_ble_sidewalk_ctx.conn_ctx) || (p_pairing_complete->Connection_Handle != sid_ble_sidewalk_ctx.conn_ctx->public_ctx.conn_id))
                    {
                        sid_err = sid_stm32wba_ble_adapter_user_on_pairing_complete(p_pairing_complete->Connection_Handle, p_pairing_complete->Status, p_pairing_complete->Reason);
                    }
                    else
#endif /* SID_STM32_BLE_COEXISTENCE_MODE */
                    {
                        sid_err = SID_ERROR_NO_PERMISSION;
                    }

                    if (sid_err != SID_ERROR_NONE)
                    {
                        /* Try to clean up the device from the bonding list */
                        sid_pal_ble_prv_connection_ctx_t * const conn_ctx = _ble_adapter_generic_get_conn_ctx_for_handle(p_pairing_complete->Connection_Handle);
                        if (conn_ctx != NULL)
                        {
                            uint8_t peer_identity_addr_type;
                            switch (conn_ctx->public_ctx.peer_addr_type)
                            {
                                case SID_BLE_HCI_ADV_PEER_ADDR_TYPE_PUBLIC:
                                case SID_BLE_HCI_ADV_PEER_ADDR_TYPE_RPA_PUBLIC_IDENTITY:
                                    peer_identity_addr_type = SID_BLE_HCI_ADV_PEER_ADDR_TYPE_PUBLIC;
                                    break;

                                case SID_BLE_HCI_ADV_PEER_ADDR_TYPE_RANDOM:
                                case SID_BLE_HCI_ADV_PEER_ADDR_TYPE_RPA_RANDOM_IDENTITY:
                                default:
                                    peer_identity_addr_type = SID_BLE_HCI_ADV_PEER_ADDR_TYPE_RANDOM;
                                    break;
                            }
                            (void)aci_gap_remove_bonded_device(peer_identity_addr_type, conn_ctx->public_ctx.peer_identity);
                        }

                        (void)aci_gap_terminate(p_pairing_complete->Connection_Handle, SID_BLE_HCI_STATUS_AUTH_FAILURE);
                    }
                }
                break;

            case ACI_GAP_BOND_LOST_VSEVT_CODE:
                {
                    SID_BLE_GENERIC_LOG_DEBUG(">>== ACI_GAP_BOND_LOST_EVENT");
                    const aci_gap_bond_lost_event_rp0 * const p_bond_lost = (aci_gap_bond_lost_event_rp0*)evt->data;

                    ret = aci_gap_allow_rebond(p_bond_lost->Connection_Handle);
                    if (ret != BLE_STATUS_SUCCESS)
                    {
                        SID_BLE_GENERIC_LOG_ERROR("==>> aci_gap_allow_rebond : Fail, reason: 0x%02X\n", ble_status);
                    }
                    else
                    {
                        SID_BLE_GENERIC_LOG_DEBUG("==>> aci_gap_allow_rebond : Success\n");
                    }
                }
                break;

            case ACI_ATT_EXCHANGE_MTU_RESP_VSEVT_CODE:
                {
                    const aci_att_exchange_mtu_resp_event_rp0 * const p_exchange_mtu = (aci_att_exchange_mtu_resp_event_rp0 *) evt->data;

                    SID_BLE_GENERIC_LOG_DEBUG(">>== ACI_ATT_EXCHANGE_MTU_RESP_VSEVT_CODE - conn: 0x%04X, mtu: %u", p_exchange_mtu->Connection_Handle, p_exchange_mtu->Server_RX_MTU);

                    /* Locate the associated generic connection context for the connection */
                    sid_pal_ble_prv_connection_ctx_t * const conn_ctx = _ble_adapter_generic_get_conn_ctx_for_handle(p_exchange_mtu->Connection_Handle);

                    if (NULL == conn_ctx)
                    {
                        SID_PAL_LOG_ERROR("No context found for BLE connection 0x%04X", p_exchange_mtu->Connection_Handle);
                        (void)aci_gap_terminate(p_exchange_mtu->Connection_Handle, SID_BLE_HCI_STATUS_UNKNOWN_CONN_ID);
                        break;
                    }

                    sid_pal_enter_critical_region();
                    /* Store the related advertising handle */
                    conn_ctx->public_ctx.mtu_size = p_exchange_mtu->Server_RX_MTU;

