stm32-hotspot/STM32-Sidewalk-SDK/pal/st/stm32wba/sid_pal/ble_adapter/sid_pal_ble_adapter_stm32wba.c
                    /* Notify the respective GATT processors */
                    if ((sid_ble_sidewalk_ctx.conn_ctx != NULL) && (p_exchange_mtu->Connection_Handle == sid_ble_sidewalk_ctx.conn_ctx->public_ctx.conn_id))
                    {
                        sid_stm32wba_ble_adapter_sidewalk_on_ble_mtu_changed();
                    }
#if (SID_STM32_BLE_COEXISTENCE_MODE == SID_STM32_BLE_COEXISTENCE_MODE_INTERLEAVING) || (SID_STM32_BLE_COEXISTENCE_MODE == SID_STM32_BLE_COEXISTENCE_MODE_CONCURRENCY)
                    else
                    {
                        (void)sid_stm32wba_ble_adapter_user_on_ble_mtu_changed(p_exchange_mtu->Connection_Handle);
                    }
#endif /* SID_STM32_BLE_COEXISTENCE_MODE */
                    sid_pal_exit_critical_region();
                }
                break;

            /* Manage ACI_GATT_INDICATION_VSEVT_CODE occurring on Android 12 */
            case ACI_GATT_INDICATION_VSEVT_CODE:
                {
                    const aci_gatt_indication_event_rp0 * const p_indication = (aci_gatt_indication_event_rp0 *)evt->data;
                    ret = aci_gatt_confirm_indication(p_indication->Connection_Handle);
                    if (ret != BLE_STATUS_SUCCESS)
                    {
                        SID_PAL_LOG_ERROR("  Fail   : aci_gatt_confirm_indication command, result: 0x%x", ret);
                    }
                    else
                    {
                        SID_PAL_LOG_DEBUG("  Success: aci_gatt_confirm_indication command");
                    }
                }
                break;

            case ACI_GATT_TX_POOL_AVAILABLE_VSEVT_CODE:
                {
                    const aci_gatt_tx_pool_available_event_rp0 * const p_tx_pool_available_event = (aci_gatt_tx_pool_available_event_rp0 *)evt->data;

                    /* TODO: this event is currently not used by the driver, but may be used to dynamically limit and restore BLE operations depending on the amount of the available RAM */
                    (void)p_tx_pool_available_event;
                }
                break;

            case ACI_GAP_AUTHORIZATION_REQ_VSEVT_CODE:
                {
                    SID_BLE_GENERIC_LOG_DEBUG(">>== ACI_GAP_AUTHORIZATION_REQ_EVENT");
                    aci_gap_authorization_req_event_rp0 * p_authorization_req = (aci_gap_authorization_req_event_rp0*)evt->data;
                    uint32_t authorize;

#if (SID_STM32_BLE_COEXISTENCE_MODE == SID_STM32_BLE_COEXISTENCE_MODE_INTERLEAVING) || (SID_STM32_BLE_COEXISTENCE_MODE == SID_STM32_BLE_COEXISTENCE_MODE_CONCURRENCY)
                    if ((NULL == sid_ble_sidewalk_ctx.conn_ctx) || (p_authorization_req->Connection_Handle != sid_ble_sidewalk_ctx.conn_ctx->public_ctx.conn_id))
                    {
                        sid_error_t sid_err;

                        /* Let the user decide if this operation is authorized */
                        sid_err = sid_stm32wba_ble_adapter_user_on_authorization_req(p_authorization_req->Connection_Handle);
                        authorize = (SID_ERROR_NONE == sid_err) ? TRUE : FALSE;
                    }
                    else
#endif /* SID_STM32_BLE_COEXISTENCE_MODE */
                    {
                        /* For Sidewalk context authorization request is never expected - reject it */
                        authorize = FALSE;
                    }

                    (void)aci_gap_authorization_resp(p_authorization_req->Connection_Handle, authorize != FALSE ? 0x01u /* authorize */ : 0x02u /* reject */);
                }
                break;

            case ACI_GATT_WRITE_PERMIT_REQ_VSEVT_CODE:
                {
                    const aci_gatt_write_permit_req_event_rp0 * const p_write_permit_req = (aci_gatt_write_permit_req_event_rp0 *)evt->data;

                    /* Handle CCCD access to the Service Changed characteristic of the GATT Service */
                    if (p_write_permit_req->Attribute_Handle == (SID_STM32_BLE_GATT_SVC_SERVICE_CHANGED_CHAR_HANDLE + SID_STM32_BLE_CHARACTERISTIC_CCCD_ATTRIBUTE_OFFSET))
                    {
                        ret = aci_gatt_write_resp(p_write_permit_req->Connection_Handle, p_write_permit_req->Attribute_Handle,
                                                  0x00u /* value can be written */, SID_STM32_BLE_ATT_STATUS_SUCCESS,
                                                  p_write_permit_req->Data_Length, p_write_permit_req->Data);
                        if (ret != BLE_STATUS_SUCCESS)
                        {
                            SID_PAL_LOG_ERROR("Failed to set BLE write response for connection 0x%04X, attribute 0x%04X. ACI error 0x%02X", p_write_permit_req->Connection_Handle, p_write_permit_req->Attribute_Handle, ret);
                            (void)aci_gap_terminate(p_write_permit_req->Connection_Handle, SID_BLE_HCI_STATUS_REMOTE_SIDE_TERMINATED);
                            break;
                        }
                    }
                }
                break;

            case ACI_WARNING_VSEVT_CODE:
                {
                    SID_BLE_GENERIC_LOG_DEBUG(">>== ACI_WARNING_EVENT");
                    const aci_warning_event_rp0 * const p_warning = (aci_warning_event_rp0 *)evt->data;

                    SID_PAL_LOG_WARNING("BLE ACI warning (0x%02X): %s", p_warning->Warning_Type, _ble_adapter_generic_aci_warning_display_str(p_warning->Warning_Type));
                    SID_PAL_HEXDUMP(SID_PAL_LOG_SEVERITY_DEBUG, p_warning->Data, p_warning->Data_Length);
                }
                break;

            default:
                /* Do nothing, allow the event flow to continue */
                break;
        }
    } while (0);

    return evt_flow_status;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static inline sid_error_t _ble_adapter_generic_conn_ctxs_init(void)
{
    sid_error_t err = SID_ERROR_NONE;
    static const osSemaphoreAttr_t gap_cmd_semaphore_attributes = {
        .name = "GAPCmdSemaphore"
    };

    for (uint32_t i = 0u; i < SID_STM32_UTIL_ARRAY_SIZE(sid_ble_drv_ctx.conn_ctxs); i++)
    {
        SID_PAL_ASSERT(NULL == sid_ble_drv_ctx.conn_ctxs[i].gap_cmd_lock);

