stm32-hotspot/STM32-Sidewalk-SDK/pal/st/stm32wba/sid_pal/ble_adapter/sid_pal_ble_adapter_stm32wba.c
        sid_ble_drv_ctx.conn_ctxs[i].gap_cmd_lock = osSemaphoreNew(1u, 0u, &gap_cmd_semaphore_attributes);
        if (NULL == sid_ble_drv_ctx.conn_ctxs[i].gap_cmd_lock)
        {
            SID_PAL_LOG_ERROR("Failed to allocate GAP cmd lock - no memory");
            err = SID_ERROR_OOM;
            break;
        }
    }

    /* Invalidate all connection contexts */
    _ble_adapter_generic_invalidate_conn_ctx(NULL);

    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static inline void _ble_adapter_generic_conn_ctxs_deinit(void)
{
    for (uint32_t i = 0u; i < SID_STM32_UTIL_ARRAY_SIZE(sid_ble_drv_ctx.conn_ctxs); i++)
    {
        if (sid_ble_drv_ctx.conn_ctxs[i].public_ctx.conn_id != SID_STM32_BLE_HANDLE_INVALID_VALUE)
        {
            SID_PAL_LOG_WARNING("Deleting BLE connection context for an active connection 0x%04X", sid_ble_drv_ctx.conn_ctxs[i].public_ctx.conn_id);
        }

        /* Delete the Semaphore used to wait for GAP commands completion */
        if (sid_ble_drv_ctx.conn_ctxs[i].gap_cmd_lock != NULL)
        {
            osStatus_t os_status;
            os_status = osSemaphoreDelete(sid_ble_drv_ctx.conn_ctxs[i].gap_cmd_lock);
            if (os_status != osOK)
            {
                SID_PAL_LOG_WARNING("Failed to delete GAP cmd lock for slot %u. Memory leak is possible", i);
            }
            sid_ble_drv_ctx.conn_ctxs[i].gap_cmd_lock = NULL;
        }

        /* Invalidate the connection context */
        _ble_adapter_generic_invalidate_conn_ctx(&sid_ble_drv_ctx.conn_ctxs[i]);
    }
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static inline void _ble_adapter_generic_invalidate_conn_ctx(sid_pal_ble_prv_connection_ctx_t * const ctx)
{
    sid_pal_ble_prv_connection_ctx_t * proc_ptr;
    sid_pal_ble_prv_connection_ctx_t * stop_ptr;

    /* Ensure ctx is either NULL or within the memory range of sid_ble_drv_ctx.conn_ctxs */
    SID_PAL_ASSERT((NULL == ctx) || ((ctx >= &sid_ble_drv_ctx.conn_ctxs[0]) && (ctx <= &sid_ble_drv_ctx.conn_ctxs[SID_STM32_UTIL_ARRAY_SIZE(sid_ble_drv_ctx.conn_ctxs) - 1])));

    if (NULL == ctx)
    {
        /* Invalidate all the contexts */
        proc_ptr = &sid_ble_drv_ctx.conn_ctxs[0];
        stop_ptr = &sid_ble_drv_ctx.conn_ctxs[SID_STM32_UTIL_ARRAY_SIZE(sid_ble_drv_ctx.conn_ctxs) - 1];
    }
    else
    {
        /* Invalidate only one specific context */
        proc_ptr = ctx;
        stop_ptr = ctx;
    }

    sid_pal_enter_critical_region();
    while (proc_ptr <= stop_ptr)
    {
        /* Store the pointer to the lock object */
        osSemaphoreId_t gap_cmd_lock = proc_ptr->gap_cmd_lock;

        /* Invalidate context */
        SID_STM32_UTIL_fast_memset(proc_ptr, 0u, sizeof(* proc_ptr));
        proc_ptr->public_ctx.conn_id = SID_STM32_BLE_HANDLE_INVALID_VALUE;
        proc_ptr->adv_set_id         = SID_STM32_BLE_HANDLE_INVALID_VALUE;

        /* Restore lock object pointer */
        proc_ptr->gap_cmd_lock = gap_cmd_lock;

        /* Move to the next connection context */
        proc_ptr++;
    }
    sid_pal_exit_critical_region();
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static inline sid_pal_ble_prv_connection_ctx_t * _ble_adapter_generic_get_free_conn_ctx(const uint16_t conn_handle)
{
    sid_pal_ble_prv_connection_ctx_t * free_ctx = NULL;

    sid_pal_enter_critical_region();
    for (uint32_t i = 0u; i < SID_STM32_UTIL_ARRAY_SIZE(sid_ble_drv_ctx.conn_ctxs); i++)
    {
        if (SID_STM32_BLE_HANDLE_INVALID_VALUE == sid_ble_drv_ctx.conn_ctxs[i].public_ctx.conn_id)
        {
            free_ctx = &sid_ble_drv_ctx.conn_ctxs[i];
            sid_ble_drv_ctx.conn_ctxs[i].public_ctx.conn_id = conn_handle;
            break;
        }
    }
    sid_pal_exit_critical_region();

    return free_ctx;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static inline sid_pal_ble_prv_connection_ctx_t * _ble_adapter_generic_get_conn_ctx_for_handle(const uint16_t conn_handle)
{
    sid_pal_ble_prv_connection_ctx_t * associated_ctx = NULL;

    sid_pal_enter_critical_region();
    for (uint32_t i = 0u; i < SID_STM32_UTIL_ARRAY_SIZE(sid_ble_drv_ctx.conn_ctxs); i++)
    {
        if (conn_handle == sid_ble_drv_ctx.conn_ctxs[i].public_ctx.conn_id)
        {
            associated_ctx = &sid_ble_drv_ctx.conn_ctxs[i];
            break;
        }
    }
    sid_pal_exit_critical_region();

    return associated_ctx;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static sid_error_t _ble_stack_init(const sid_pal_ble_prv_operating_mode_t init_type)
{
    sid_error_t         err = SID_ERROR_GENERIC;
    SNVMA_Cmd_Status_t  snvma_err;
    tBleStatus          ble_err;

    SID_PAL_LOG_DEBUG("==>> Start ble_stack_init function");

    do
    {
        /* Ensure we have a valid config to proceed with initialization */
        if (NULL == sid_ble_drv_ctx.cfg)
        {
            SID_PAL_LOG_ERROR("  Fail   : Cannot initialize BLE stack, config is NULL");
            err = SID_ERROR_INVALID_ARGS;
            break;
        }

        /* Initialize stack event queue */
        SID_PAL_ASSERT(((NULL == BleAsynchEventQueue.next) && (NULL == BleAsynchEventQueue.prev)) || (LST_is_empty(&BleAsynchEventQueue) != FALSE));
        LST_init_head(&BleAsynchEventQueue);

        /* Initialize RTOS threads and associated resources */
        if ((BleHostSemaphore != NULL) || (ble_host_task != NULL))
        {
            err = SID_ERROR_ALREADY_INITIALIZED;
            break;
        }
        BleHostSemaphore = osSemaphoreNew(1u, 0u, &ble_host_semaphore_atributes);
        ble_host_task = osThreadNew(BleStack_Process_BG_Entry, NULL, &ble_host_task_atributes);
        if ((NULL == BleHostSemaphore) || (NULL == ble_host_task))
        {
            err = SID_ERROR_OUT_OF_RESOURCES;
            break;
        }

