stm32-hotspot/STM32-Sidewalk-SDK/pal/st/stm32wba/sid_pal/ble_adapter/sid_pal_ble_adapter_stm32wba.c
        /*----------------------------------------------------------------------------*/

        if ((hci_async_evt_semaphore != NULL) || (hci_async_evt_task != NULL))
        {
            err = SID_ERROR_ALREADY_INITIALIZED;
            break;
        }
        hci_async_evt_semaphore = osSemaphoreNew(1u, 0u, &hci_async_evt_semaphore_attributes);
        hci_async_evt_task = osThreadNew(Ble_UserEvtRx_Entry, NULL, &hci_async_evt_task_attributes);
        if ((NULL == hci_async_evt_semaphore) || (NULL == hci_async_evt_task))
        {
            err = SID_ERROR_OUT_OF_RESOURCES;
            break;
        }

        /*----------------------------------------------------------------------------*/

#if (SID_STM32_BLE_EXTENDED_ADV_SUPPORTED == 0)
        UTIL_TIMER_Status_t timer_err;

        if ((sid_ble_drv_ctx.advertising_cmd_queue != NULL) || (sid_ble_drv_ctx.advertising_cmd_task != NULL))
        {
            err = SID_ERROR_ALREADY_INITIALIZED;
            break;
        }
        sid_ble_drv_ctx.advertising_cmd_queue = osMessageQueueNew(SID_STM32_BLE_PRV_ADVERTISING_CMD_QUEUE_LEN, SID_STM32_UTIL_STRUCT_MEMBER_SIZE(UTIL_TIMER_Object_t, argument), &advertising_cmd_queue_attributes);
        sid_ble_drv_ctx.advertising_cmd_task = osThreadNew(_ble_adapter_generic_adv_cmd_task_entry, NULL, &advertising_cmd_task_attributes);
        if ((NULL == sid_ble_drv_ctx.advertising_cmd_queue) || (NULL == sid_ble_drv_ctx.advertising_cmd_task))
        {
            err = SID_ERROR_OUT_OF_RESOURCES;
            break;
        }

        /* Create timer to enter Low Power Advertising */
        timer_err = UTIL_TIMER_Create(&(sid_ble_drv_ctx.adv_timer),
                                      0u, /* Timer period is updated dynamically on BLE advertisement start */
                                      UTIL_TIMER_ONESHOT,
                                      &_ble_adapter_generic_adv_duration_timer_cb, NULL);
        if (timer_err != UTIL_TIMER_OK)
        {
            SID_PAL_LOG_ERROR("  Fail   : Advertisement timer create, result: %d", (int32_t)timer_err);
            err = SID_ERROR_OUT_OF_RESOURCES;
            break;
        }
#endif /* SID_STM32_BLE_EXTENDED_ADV_SUPPORTED */

        /*----------------------------------------------------------------------------*/

        /* Initialize NVM RAM buffer, invalidate it's content before restore */
        SID_STM32_UTIL_fast_memset(host_nvm_buffer, 0u, sizeof(host_nvm_buffer));

        /* Register the APP BLE buffer */
        snvma_err = SNVMA_Register(APP_BLE_NvmBuffer,
                                   (uint32_t *)host_nvm_buffer,
                                   (CFG_BLE_NVM_SIZE_MAX * 2u));
        if (snvma_err != SNVMA_ERROR_OK)
        {
            SID_PAL_LOG_ERROR("  Fail   : SNVMA_Register command, result: 0x%02X", snvma_err);
            err = SID_ERROR_IO_ERROR;
            break;
        }

        /* Restore buffer from flash */
        snvma_err = SNVMA_Restore(APP_BLE_NvmBuffer);
        if ((snvma_err != SNVMA_ERROR_OK) && (snvma_err != SNVMA_ERROR_NVM_BANK_EMPTY) && (snvma_err != SNVMA_ERROR_NVM_BANK_CORRUPTED))
        {
            SID_PAL_LOG_ERROR("  Fail   : SNVMA_Restore command, result: 0x%02X", snvma_err);
            err = SID_ERROR_STORAGE_READ_FAIL;
            break;
        }

        /* Initialize the BLE Host */
        ble_err = HOST_BLE_Init(sid_ble_drv_ctx.cfg, init_type, host_nvm_buffer, &sid_ble_drv_ctx.global_att_mtu_size);
        if (ble_err != BLE_STATUS_SUCCESS)
        {
            SID_PAL_LOG_ERROR("  Fail   : HOST_BLE_Init command, result: 0x%02X", ble_err);
            err = SID_ERROR_IO_ERROR;
            break;
        }

        /**
         * Workaround across lack of de-initialization support in LL - as LL will call ll_sys_dependencies_init() only at first startup, we additionally
         * call it here every time BLE stack is (re)initialized. This won't cause any troubles with LL since after ll_sys_dependencies_init() is completed
         * it sets an indication that initialization is performed and it skips repetitive initialization till ll_sys_dependencies_deinit() call
         *
         * Call to ll_sys_dependencies_init() shall follow the call to HOST_BLE_Init() to guarantee that LL's memory manager is ready
         */
        ll_sys_dependencies_init();

#ifndef SID_PAL_ASSERT_DISABLED
        /* Verify the actual WPAN stack version matches the expected one. This is the protection from systematic failures when incompatible static libraries were linked */
        uint32_t stack_version[2], options[1], debug_info[3];
        ble_err = aci_get_information(stack_version, options, debug_info);
        SID_PAL_ASSERT(BLE_STATUS_SUCCESS == ble_err);

        const uint16_t stack_build_number = (uint16_t)(stack_version[1] & 0xFFFFu);
        SID_PAL_ASSERT(SID_STM32_WPAN_STACK_EXPECTED_BUILD_NUMBER == stack_build_number);
#endif /* SID_PAL_ASSERT_DISABLED */
  
        err = SID_ERROR_NONE;
    } while (0);

    SID_PAL_LOG_DEBUG("==>> End ble_stack_init function");

    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static sid_error_t _reload_bonded_devices(void)
{
    sid_error_t err = SID_ERROR_GENERIC;
    sid_error_t ble_list_error = SID_ERROR_NONE;
    tBleStatus ble_status;

    do
    {
        /* Check if bonding is used at all */
        if (sid_ble_drv_ctx.security_cfg.enable_bonding != FALSE)
        {
            /* Load bonded devices from the controller/NVM */
            Bonded_Device_Entry_t bonded_list[SID_STM32_BLE_BONDING_LIST_MAX_ENTRIES + SID_STM32_BLE_BONDING_LIST_OVERHEAD_ENTRIES];
            List_Entry_t * resolving_list_entries;
            uint8_t bond_cnt;

            /* Compile-time checks to ensure List_Entry_t and Bonded_Device_Entry_t definitions are interchangeable */
            static_assert(sizeof(List_Entry_t) == sizeof(Bonded_Device_Entry_t));
            static_assert(SID_STM32_UTIL_STRUCT_MEMBER_SIZE(List_Entry_t, Address_Type) == SID_STM32_UTIL_STRUCT_MEMBER_SIZE(Bonded_Device_Entry_t, Address_Type));
            static_assert(SID_STM32_UTIL_STRUCT_MEMBER_SIZE(List_Entry_t, Address) == SID_STM32_UTIL_STRUCT_MEMBER_SIZE(Bonded_Device_Entry_t, Address));
            static_assert(offsetof(List_Entry_t, Address_Type) == offsetof(Bonded_Device_Entry_t, Address_Type));
            static_assert(offsetof(List_Entry_t, Address) == offsetof(Bonded_Device_Entry_t, Address));

