stm32-hotspot/STM32-Sidewalk-SDK/pal/st/stm32wba/sid_pal/ble_adapter/sid_pal_ble_adapter_stm32wba.c
            /* Get the list of the bonded devices */
            ble_status = aci_gap_get_bonded_devices(&bond_cnt, bonded_list);
            if (ble_status != BLE_STATUS_SUCCESS)
            {
              SID_PAL_LOG_ERROR("  Fail   : aci_gap_get_bonded_devices command, result: 0x%02X", ble_status);
                err = SID_ERROR_IO_ERROR;
                break;
            }

            /* Manage the quantity of the bonded devices */
            if (bond_cnt > SID_STM32_UTIL_ARRAY_SIZE(bonded_list))
            {
                /* This is a fatal error, we don't know what data got corrupted as a result */
                SID_PAL_LOG_ERROR("Buffer overflow on loading bonded BLE devices list. Buffer size: %u, actual devices: %u", SID_STM32_UTIL_ARRAY_SIZE(bonded_list), bond_cnt);
                err = SID_ERROR_BUFFER_OVERFLOW;
                break;
            }
#if SID_STM32_BLE_AUTO_MANAGE_OLD_BONDS
            else if (bond_cnt > SID_STM32_BLE_BONDING_LIST_MAX_ENTRIES)
            {
                /* The number of bondings exceed the limit - delete the oldest records */
                for (uint32_t i = 0u; i < (bond_cnt - SID_STM32_BLE_BONDING_LIST_MAX_ENTRIES); i++)
                {
                    ble_status = aci_gap_remove_bonded_device(bonded_list[i].Address_Type, bonded_list[i].Address);
                    if (ble_status != BLE_STATUS_SUCCESS)
                    {
                        SID_BLE_GENERIC_LOG_ERROR("  Fail   : aci_gap_remove_bonded_device command, result: 0x%02X", ble_status);
                        /* Don't react on the error since this is not critical */
                    }
                }

                SID_PAL_LOG_WARNING("Max number of BLE bondings (%u) exceeded. %u oldest bond(s) removed", SID_STM32_BLE_BONDING_LIST_MAX_ENTRIES, (bond_cnt - SID_STM32_BLE_BONDING_LIST_MAX_ENTRIES));

                /* Use only the SID_STM32_BLE_BONDING_LIST_MAX_ENTRIES latest entries, skip the oldest ones in the RAM buffer */
                resolving_list_entries = (List_Entry_t *)&bonded_list[bond_cnt - SID_STM32_BLE_BONDING_LIST_MAX_ENTRIES];
                bond_cnt = SID_STM32_BLE_BONDING_LIST_MAX_ENTRIES; /* The list was trimmed to contain exactly SID_STM32_BLE_BONDING_LIST_MAX_ENTRIES records */
            }
#endif /* SID_STM32_BLE_AUTO_MANAGE_OLD_BONDS */
            else
            {
                /* Nothing to do, there are no excessive bondings in the list */
                resolving_list_entries = (List_Entry_t *)bonded_list;
            }

            /* Add existing bonded devices to the address resolution list and access filter list */
            ble_status = aci_gap_add_devices_to_list(bond_cnt, resolving_list_entries, SID_STM32_BLE_ADD_TO_LIST_MODE_CLEAR_SET_BOTH);
            if (ble_status != BLE_STATUS_SUCCESS)
            {
                /* This is fine - BLE controller is advertising or a new connection is pending, proceed normally and indicate that lists should be updated at a later time */
                ble_list_error = SID_ERROR_BUSY;
                SID_BLE_GENERIC_LOG_ERROR("  Fail   : aci_gap_add_devices_to_list command, result: 0x%02X", ble_status);
            }
            else
            {
                SID_PAL_LOG_INFO("(Re)loaded %u BLE bonds", bond_cnt);
            }
        }

        /* Add local host to the address resolution database to enable RPA in advertisements */
        List_Entry_t own_identity_addr;
#if SID_STM32_BLE_USE_RANDOM_IDENTITY_ADDRESS
        sid_pal_ble_prv_bt_addr_buffer_t static_rand_addr;
        err = sid_stm32wba_ble_adapter_util_get_host_static_random_addr(&static_rand_addr);
        if (err != SID_ERROR_NONE)
        {
            SID_PAL_LOG_ERROR("  Fail   : unable to load BLE static random address");
            break;
        }

        own_identity_addr.Address_Type = SID_BLE_HCI_ADV_PEER_ADDR_TYPE_RANDOM;
        SID_STM32_UTIL_fast_memcpy(own_identity_addr.Address, static_rand_addr.bytes, sizeof(own_identity_addr.Address));
#else
        own_identity_addr.Address_Type = SID_BLE_HCI_ADV_PEER_ADDR_TYPE_PUBLIC;
        SID_STM32_UTIL_fast_memcpy(own_identity_addr.Address, pub_addr.bytes, sizeof(own_identity_addr.Address));
#endif /* SID_STM32_BLE_USE_RANDOM_IDENTITY_ADDRESS */

        ble_status = aci_gap_add_devices_to_list(1u, &own_identity_addr, SID_STM32_BLE_ADD_TO_LIST_MODE_APPEND_RESOLVING_ONLY);
        if (ble_status != BLE_STATUS_SUCCESS)
        {
            /* This is fine - BLE controller is advertising or a new connection is pending, proceed normally and indicate that lists should be updated at a later time */
            ble_list_error = SID_ERROR_BUSY;
            SID_BLE_GENERIC_LOG_ERROR("  Fail   : aci_gap_add_devices_to_list command, result: 0x%02X", ble_status);
        }
        else
        {
        	SID_BLE_GENERIC_LOG_DEBUG("  Success: aci_gap_add_devices_to_list command");
        }

        /* Done */
        err = ble_list_error;
    } while (0);

    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static sid_error_t _gap_and_gatt_params_init(const sid_pal_ble_prv_operating_mode_t init_type)
{
    sid_error_t err = SID_ERROR_GENERIC;

    SID_PAL_LOG_DEBUG("==>> Start gap_and_gatt_params_init function");

    do
    {
        uint8_t         gap_role = 0u;
        uint16_t        gap_appearance = CFG_GAP_APPEARANCE;
        int16_t         tx_power;
        tBleStatus      ret = BLE_STATUS_INVALID_PARAMS;

        /* Validate inputs */
        if (NULL == sid_ble_drv_ctx.cfg)
        {
            SID_PAL_LOG_ERROR("  Fail   : Cannot initialize BLE GAP and GATT params. BLE config is NULL");
            err = SID_ERROR_INVALID_ARGS;
            break;
        }

        /* Ensure init_type is aligned with the static driver config */
#if (SID_STM32_BLE_COEXISTENCE_MODE == SID_STM32_BLE_COEXISTENCE_MODE_NONE)
        if (init_type != SPBP_OPERATING_MODE_SIDEWALK)
#elif (SID_STM32_BLE_COEXISTENCE_MODE == SID_STM32_BLE_COEXISTENCE_MODE_INTERLEAVING)
        if (init_type == SPBP_OPERATING_MODE_CONCURRENT)
#elif (SID_STM32_BLE_COEXISTENCE_MODE == SID_STM32_BLE_COEXISTENCE_MODE_CONCURRENCY)
        if (init_type != SPBP_OPERATING_MODE_CONCURRENT)
#else
        /* Unconditionally report the error */
#endif /* SID_STM32_BLE_COEXISTENCE_MODE */
        {
            SID_PAL_LOG_ERROR("  Fail   : Mismatch between the BLE driver cfg and requested init type. Cfg mode: %u, init type: %u", SID_STM32_BLE_COEXISTENCE_MODE, (uint32_t)init_type);
        }

