stm32-hotspot/STM32-Sidewalk-SDK/pal/st/stm32wba/sid_pal/ble_adapter/sid_pal_ble_adapter_stm32wba.c
        /*----------------------------------------------------------------------------*/

        /* Configure LE event mask - stack default is 0x000000C7FFF7F85F */
        const uint64_t hci_le_event_mask = (
                            /* SID_BLE_HCI_LE_EVENT_MASK_CONN_COMPLETE - not used, driver relies on SID_BLE_HCI_LE_EVENT_MASK_ENHANCED_CONN_COMPLETE event */
                               SID_BLE_HCI_LE_EVENT_MASK_ADV_REPORT
                             | SID_BLE_HCI_LE_EVENT_MASK_CONN_UPDATE_COMPLETE
                             | SID_BLE_HCI_LE_EVENT_MASK_READ_REMOTE_FEATURES_COMPLETE
                             | SID_BLE_HCI_LE_EVENT_MASK_LTK_REQUEST
                             | SID_BLE_HCI_LE_EVENT_MASK_REMOTE_CONN_PARAMETER_REQ
                             | SID_BLE_HCI_LE_EVENT_MASK_DATA_LENGTH_CHANGE
                            /* SID_BLE_HCI_LE_EVENT_MASK_READ_LOCAL_P256_KEY_COMPLETE - not used */
                            /* SID_BLE_HCI_LE_EVENT_MASK_GENERATE_DHKEY_COMPLETE - not used */
                             | SID_BLE_HCI_LE_EVENT_MASK_ENHANCED_CONN_COMPLETE
                            /* SID_BLE_HCI_LE_EVENT_MASK_DIRECTED_ADV_REPORT - not used */
                             | SID_BLE_HCI_LE_EVENT_MASK_PHY_UPDATE_COMPLETE
                             | SID_BLE_HCI_LE_EVENT_MASK_EXTENDED_ADV_REPORT
                             | SID_BLE_HCI_LE_EVENT_MASK_PERIODIC_ADV_SYNC_ESTABLISHED
                             | SID_BLE_HCI_LE_EVENT_MASK_PERIODIC_ADV_REPORT
                             | SID_BLE_HCI_LE_EVENT_MASK_PERIODIC_ADV_SYNC_LOST
                             | SID_BLE_HCI_LE_EVENT_MASK_SCAN_TIMEOUT
                             | SID_BLE_HCI_LE_EVENT_MASK_ADV_SET_TERMINATED
                             | SID_BLE_HCI_LE_EVENT_MASK_SCAN_REQUEST_RECEIVED
                            /* SID_BLE_HCI_LE_EVENT_MASK_CHANNEL_SELECTION_ALGO - not used */
                             | SID_BLE_HCI_LE_EVENT_MASK_CONNECTIONLESS_IQ_REPORT
                             | SID_BLE_HCI_LE_EVENT_MASK_CONN_IQ_REPORT
                             | SID_BLE_HCI_LE_EVENT_MASK_CTE_REQUEST_FAILED
                             | SID_BLE_HCI_LE_EVENT_MASK_PERIODIC_ADV_SYNC_TRANSFER_RECEIVED
                             | SID_BLE_HCI_LE_EVENT_MASK_CIS_ESTABLISHED
                             | SID_BLE_HCI_LE_EVENT_MASK_CIS_REQUEST
                             | SID_BLE_HCI_LE_EVENT_MASK_CREATE_BIG_COMPLETE
                             | SID_BLE_HCI_LE_EVENT_MASK_TERMINATE_BIG_COMPLETE
                             | SID_BLE_HCI_LE_EVENT_MASK_BIG_SYNC_ESTABLISHED
                             | SID_BLE_HCI_LE_EVENT_MASK_BIG_SYNC_LOST
                             | SID_BLE_HCI_LE_EVENT_MASK_REQUEST_PEER_SCA_COMPLETE
                             | SID_BLE_HCI_LE_EVENT_MASK_PATH_LOSS_THRESHOLD
                             | SID_BLE_HCI_LE_EVENT_MASK_TRANSMIT_POWER_REPORTING
                             | SID_BLE_HCI_LE_EVENT_MASK_BIGINFO_ADV_REPORT
                             | SID_BLE_HCI_LE_EVENT_MASK_SUBRATE_CHANGE
                            /* SID_BLE_HCI_LE_EVENT_MASK_PERIODIC_ADV_SYNC_ESTABLISHED_V2 - not used */
                            /* SID_BLE_HCI_LE_EVENT_MASK_PERIODIC_ADV_REPORT_V2 */
                            /* SID_BLE_HCI_LE_EVENT_MASK_PERIODIC_ADV_SYNC_TRANSFER_RECEIVED_V2 - not used */
                             | SID_BLE_HCI_LE_EVENT_MASK_PERIODIC_ADV_SUBEVT_DATA_REQUEST
                             | SID_BLE_HCI_LE_EVENT_MASK_PERIODIC_ADV_RESPONSE_REPORT
                            /* SID_BLE_HCI_LE_EVENT_MASK_ENHANCED_CONN_COMPLETE_V2 - not used */
        );

        ret = hci_le_set_event_mask((void*)&hci_le_event_mask);
        if (ret != BLE_STATUS_SUCCESS)
        {
            SID_PAL_LOG_ERROR("  Fail   : hci_le_set_event_mask command, result: 0x%02X", ret);
            err = SID_ERROR_IO_ERROR;
            break;
        }
        SID_PAL_LOG_DEBUG("  Success: hci_le_set_event_mask command");

        /* Load public address into the controller */
        sid_pal_ble_prv_bt_addr_buffer_t pub_addr;
        err = sid_stm32wba_ble_adapter_util_get_host_public_addr(&pub_addr);
        if (err != SID_ERROR_NONE)
        {
            SID_PAL_LOG_ERROR("  Fail   : unable to load BLE public address");
            break;
        }
        ret = aci_hal_write_config_data(CONFIG_DATA_PUBLIC_ADDRESS_OFFSET,
                                        CONFIG_DATA_PUBLIC_ADDRESS_LEN,
                                        (uint8_t*)pub_addr.bytes);
        if (ret != BLE_STATUS_SUCCESS)
        {
            SID_PAL_LOG_ERROR("  Fail   : aci_hal_write_config_data command - CONFIG_DATA_PUBLIC_ADDRESS_OFFSET, result: 0x%02X", ret);
            err = SID_ERROR_IO_ERROR;
            break;
        }
        SID_PAL_LOG_DEBUG("  Success: aci_hal_write_config_data command - CONFIG_DATA_PUBLIC_ADDRESS_OFFSET");
        SID_PAL_LOG_DEBUG("   Public Bluetooth Address: %02x:%02x:%02x:%02x:%02x:%02x",pub_addr.bytes[5],pub_addr.bytes[4],pub_addr.bytes[3],pub_addr.bytes[2],pub_addr.bytes[1],pub_addr.bytes[0]);

        /* Configure random address  */
        err = sid_stm32wba_ble_adapter_prv_rotate_random_mac_address(NULL, SID_BLE_CFG_MAC_ADDRESS_TYPE_STATIC_RANDOM);
        if (err != SID_ERROR_NONE)
        {
            SID_PAL_LOG_ERROR("  Fail   : unable to configure BLE random address");
            break;
        }
        SID_PAL_LOG_DEBUG("  Success: rotate_random_mac_address");

        /* Write local Identity Root Key (IRK) */
        sid_pal_ble_prv_irk_buffer_t irk_seed;
        err = sid_stm32wba_ble_adapter_util_get_local_irk_seed(&irk_seed);
        if (err != SID_ERROR_NONE)
        {
            SID_PAL_LOG_ERROR("  Fail   : unable to load local BLE IRK");
            break;
        }
        ret = aci_hal_write_config_data(CONFIG_DATA_IR_OFFSET, CONFIG_DATA_IR_LEN, (uint8_t*)irk_seed.bytes);
        if (ret != BLE_STATUS_SUCCESS)
        {
            SID_PAL_LOG_ERROR("  Fail   : aci_hal_write_config_data command - CONFIG_DATA_IR_OFFSET, result: 0x%02X", ret);
            err = SID_ERROR_IO_ERROR;
            break;
        }
        SID_PAL_LOG_DEBUG("  Success: aci_hal_write_config_data command - CONFIG_DATA_IR_OFFSET");

