stm32-hotspot/STM32-Sidewalk-SDK/pal/st/stm32wba/sid_pal/ble_adapter/sid_pal_ble_adapter_stm32wba.c
        /* Write Encryption Root Key (ERK) used to derive LTK and CSRK */
        sid_pal_ble_prv_erk_buffer_t erk;
        err = sid_stm32wba_ble_adapter_util_get_erk(&erk);
        if (err != SID_ERROR_NONE)
        {
            SID_PAL_LOG_ERROR("  Fail   : unable to load BLE ERK");
            break;
        }
        ret = aci_hal_write_config_data(CONFIG_DATA_ER_OFFSET, CONFIG_DATA_ER_LEN, (uint8_t*)erk.bytes);
        if (ret != BLE_STATUS_SUCCESS)
        {
            SID_PAL_LOG_ERROR("  Fail   : aci_hal_write_config_data command - CONFIG_DATA_ER_OFFSET, result: 0x%02X", ret);
            err = SID_ERROR_IO_ERROR;
            break;
        }
        SID_PAL_LOG_DEBUG("  Success: aci_hal_write_config_data command - CONFIG_DATA_ER_OFFSET");

        /* Set TX Power limit */
        ret = aci_hal_set_tx_power_level(0x01u, CFG_BLE_MAX_TX_POWER);
        if (ret != BLE_STATUS_SUCCESS)
        {
            SID_PAL_LOG_ERROR("  Fail   : aci_hal_set_tx_power_level command, result: 0x%02X", ret);
            err = SID_ERROR_IO_ERROR;
            break;
        }
        SID_PAL_LOG_DEBUG("  Success: aci_hal_set_tx_power_level command");

        /* Print the configure Tx power to logs */
        tx_power = CFG_BLE_MAX_TX_POWER < SID_STM32_UTIL_ARRAY_SIZE(ble_tx_pwr_to_dbm_lut) ? ble_tx_pwr_to_dbm_lut[CFG_BLE_MAX_TX_POWER] : INT16_MIN;
        /* Compute integer and fractional parts since tiny_vsnprintf may not support %f printout */
        const uint32_t pwr_int_db   = tx_power > 0 ? (uint32_t)(tx_power / 100) : (uint32_t)((-tx_power) / 100);
        const uint32_t pwr_fract_db = tx_power > 0 ? (uint32_t)(tx_power % 100 / 10 ) : (uint32_t)((-tx_power) % 100 / 10);
        SID_PAL_LOG_INFO("BLE max Tx power: %s%u.%udBm", tx_power < 0 ? "-" : "+", pwr_int_db, pwr_fract_db);

        /* Initialize GATT interface */
        ret = aci_gatt_init();
        if (ret != BLE_STATUS_SUCCESS)
        {
            SID_PAL_LOG_ERROR("  Fail   : aci_gatt_init command, result: 0x%02X", ret);
            err = SID_ERROR_IO_ERROR;
            break;
        }
        SID_PAL_LOG_DEBUG("  Success: aci_gatt_init command");

        /* Initialize GAP interface */
        if ((SPBP_OPERATING_MODE_SIDEWALK == init_type) || (SPBP_OPERATING_MODE_CONCURRENT == init_type))
        {
            /* Peripheral role is always required for Sidewalk link */
            gap_role = GAP_PERIPHERAL_ROLE;
        }

#if (SID_STM32_BLE_COEXISTENCE_MODE == SID_STM32_BLE_COEXISTENCE_MODE_INTERLEAVING) || (SID_STM32_BLE_COEXISTENCE_MODE == SID_STM32_BLE_COEXISTENCE_MODE_CONCURRENCY)
        if ((SPBP_OPERATING_MODE_USER == init_type) || (SPBP_OPERATING_MODE_CONCURRENT == init_type))
        {
            SID_PAL_ASSERT(sid_ble_drv_ctx.cfg->custom_profiles.virtual_devices != NULL);
            SID_PAL_ASSERT(sid_ble_drv_ctx.cfg->custom_profiles.num_virtual_devices != 0u);

            /* Enrich GAP role with the user-selected options */
            for (uint32_t i = 0u; i < sid_ble_drv_ctx.cfg->custom_profiles.num_virtual_devices; i++)
            {
                const sid_ble_ext_virtual_device_t * const virt_dev_desc = &sid_ble_drv_ctx.cfg->custom_profiles.virtual_devices[i];
                SID_PAL_ASSERT(virt_dev_desc != NULL);

                switch (virt_dev_desc->device_type)
                {
                    case SBEVDR_BLE_PERIPHERAL:
#if SID_STM32_BLE_GAP_ROLE_PERIPHERAL_SUPPORTED
                        gap_role |= GAP_PERIPHERAL_ROLE;
#else
                        SID_PAL_LOG_ERROR("BLE GAP peripheral role is not supported by BLE stack");
                        err = SID_ERROR_NOSUPPORT;
#endif /* SID_STM32_BLE_GAP_ROLE_PERIPHERAL_SUPPORTED */
                        break;

                    case SBEVDR_BLE_BROADCASTER:
#if SID_STM32_BLE_GAP_ROLE_BROADCASTER_SUPPORTED
                        gap_role |= GAP_BROADCASTER_ROLE;
#else
                        SID_PAL_LOG_ERROR("BLE GAP broadcaster role is not supported by BLE stack");
                        err = SID_ERROR_NOSUPPORT;
#endif /* SID_STM32_BLE_GAP_ROLE_BROADCASTER_SUPPORTED */
                        break;

                    case SBEVDR_BLE_CENTRAL:
#if SID_STM32_BLE_GAP_ROLE_CENTRAL_SUPPORTED
                        gap_role |= GAP_CENTRAL_ROLE;
#else
                        SID_PAL_LOG_ERROR("BLE GAP central role is not supported by BLE stack");
                        err = SID_ERROR_NOSUPPORT;
#endif /* SID_STM32_BLE_GAP_ROLE_CENTRAL_SUPPORTED */
                        break;

                    case SBEVDR_BLE_OBSERVER:
#if SID_STM32_BLE_GAP_ROLE_OBSERVER_SUPPORTED
                        gap_role |= GAP_OBSERVER_ROLE;
#else
                        SID_PAL_LOG_ERROR("BLE GAP observer role is not supported by BLE stack");
                        err = SID_ERROR_NOSUPPORT;
#endif /* SID_STM32_BLE_GAP_ROLE_OBSERVER_SUPPORTED */
                        break;

                    default:
                        SID_PAL_LOG_ERROR("Unknown BLE GAP role selected: %u", (uint32_t)virt_dev_desc->device_type);
                        err = SID_ERROR_INVALID_ARGS;
                        break;
                }

                /* Terminate loop if error occurred */
                if (err != SID_ERROR_NONE)
                {
                    break;
                }
            }

            /* Terminate if GAP role selection failed */
            if (err != SID_ERROR_NONE)
            {
                break;
            }
        }
#else
        SID_PAL_ASSERT(SPBP_OPERATING_MODE_SIDEWALK == init_type);
#endif /* SID_STM32_BLE_COEXISTENCE_MODE */

        SID_PAL_ASSERT(gap_role != 0u);
        SID_PAL_LOG_DEBUG("   Selected GAP roles: 0x%02X", gap_role);

        /* Prepare GAP device name value */
        const char * gap_device_name = sid_ble_drv_ctx.cfg->sidewalk_profile.device_name;
        uint32_t     gap_device_name_len;

        if (gap_device_name != NULL)
        {
            gap_device_name_len = strlen(gap_device_name);
            if (gap_device_name_len > SID_STM32_BLE_GAP_DEVICE_NAME_MAX_LEN)
            {
                gap_device_name_len = SID_STM32_BLE_GAP_DEVICE_NAME_MAX_LEN;
            }
        }
        else
        {
            gap_device_name_len = 0u;
        }

        /* Initialize GAP */
        ret = aci_gap_init(gap_role,
                           PRIVACY_ENABLED,
                           SID_STM32_BLE_GAP_DEVICE_NAME_MAX_LEN,
                           &sid_ble_drv_ctx.gap_service_handle,
                           &sid_ble_drv_ctx.gap_dev_name_char_handle,
                           &sid_ble_drv_ctx.gap_appearance_char_handle);
        if (ret != BLE_STATUS_SUCCESS)
        {
            SID_PAL_LOG_ERROR("  Fail   : aci_gap_init command, result: 0x%02X", ret);
            err = SID_ERROR_IO_ERROR;
            break;
        }
        SID_PAL_LOG_DEBUG("  Success: aci_gap_init command");

