stm32-hotspot/STM32-Sidewalk-SDK/pal/st/stm32wba/sid_pal/ble_adapter/sid_pal_ble_adapter_stm32wba.c
        /* Update GAP device name */
        if (gap_device_name_len > 0u)
        {
            ret = aci_gatt_update_char_value(sid_ble_drv_ctx.gap_service_handle,
                                             sid_ble_drv_ctx.gap_dev_name_char_handle,
                                             0u,
                                             gap_device_name_len,
                                             (uint8_t *)gap_device_name);
            if (ret != BLE_STATUS_SUCCESS)
            {
                SID_PAL_LOG_ERROR("  Fail   : aci_gatt_update_char_value - Device Name, result: 0x%02X", ret);
                err = SID_ERROR_IO_ERROR;
                break;
            }
            SID_PAL_LOG_DEBUG("  Success: aci_gatt_update_char_value - Device Name");
        }

        /* Update GAP appearance */
        ret = aci_gatt_update_char_value(sid_ble_drv_ctx.gap_service_handle,
                                         sid_ble_drv_ctx.gap_appearance_char_handle,
                                         0u,
                                         sizeof(gap_appearance),
                                         (uint8_t *)(void *)&gap_appearance);
        if (ret != BLE_STATUS_SUCCESS)
        {
            SID_PAL_LOG_ERROR("  Fail   : aci_gatt_update_char_value - Appearance, result: 0x%02X", ret);
            err = SID_ERROR_IO_ERROR;
            break;
        }
        SID_PAL_LOG_DEBUG("  Success: aci_gatt_update_char_value - Appearance");

        /* Set preferred connection parameters */
        SID_PAL_ASSERT(sid_ble_sidewalk_ctx.ble_cfg != NULL);
        sid_ble_drv_ctx.gap_ppcp_char_handle = sid_ble_drv_ctx.gap_appearance_char_handle + SID_STM32_BLE_PPCP_CHAR_HANDLE_OFFSET;
        err = sid_stm32wba_ble_adapter_util_set_gap_ppcp_char(&sid_ble_sidewalk_ctx.ble_cfg->conn_param);
        if (err != SID_ERROR_NONE)
        {
            break;
        }

        /* Initialize Default PHY */
        ret = hci_le_set_default_phy(0x00, HCI_TX_PHYS_LE_2M_PREF, HCI_RX_PHYS_LE_2M_PREF);
        if (ret != BLE_STATUS_SUCCESS)
        {
            SID_PAL_LOG_ERROR("  Fail   : hci_le_set_default_phy command, result: 0x%02X", ret);
            err = SID_ERROR_IO_ERROR;
            break;
        }
        SID_PAL_LOG_DEBUG("  Success: hci_le_set_default_phy command");

#if SID_STM32_BLE_DLE_ENABLE
        /* Enable data length extension (DLE) */
        ret = hci_le_write_suggested_default_data_length(SID_STM32_BLE_DLE_MAX_TX_OCTETS, SID_STM32_BLE_DLE_MAX_TX_TIME_US);
        if (ret != BLE_STATUS_SUCCESS)
        {
            SID_PAL_LOG_ERROR("  Fail   : hci_le_write_suggested_default_data_length command, result: 0x%02X", ret);
            err = SID_ERROR_IO_ERROR;
            break;
        }
        SID_PAL_LOG_DEBUG("  Success: hci_le_write_suggested_default_data_length command");
#endif /* SID_STM32_BLE_DLE_ENABLE */

        /* Initialize IO capability */
        if (SPBP_OPERATING_MODE_SIDEWALK == init_type)
        {
            /* Sidewalk uses JustWorks method, so we don't need to allocate any resources to support IO capabilities */
            sid_ble_drv_ctx.security_cfg.io_capability = IO_CAP_NO_INPUT_NO_OUTPUT;
        }
        else
        {
            /* Use actual I/O capabilities of the host platform */
            sid_ble_drv_ctx.security_cfg.io_capability = CFG_IO_CAPABILITY;
        }
        ret = aci_gap_set_io_capability(sid_ble_drv_ctx.security_cfg.io_capability);
        if (ret != BLE_STATUS_SUCCESS)
        {
            SID_PAL_LOG_ERROR("  Fail   : aci_gap_set_io_capability command, result: 0x%02X", ret);
            err = SID_ERROR_IO_ERROR;
            break;
        }
        SID_PAL_LOG_DEBUG("  Success: aci_gap_set_io_capability command");

        /* Initialize authentication */
        if (SPBP_OPERATING_MODE_SIDEWALK == init_type)
        {
            /* Sidewalk-only config - rely on JustWorks, encryption is implemented on the Sidewalk link layer above the non-secure BLE connection */
            sid_ble_drv_ctx.security_cfg.keypress_support      = KEYPRESS_NOT_SUPPORTED;
            sid_ble_drv_ctx.security_cfg.mitm_mode             = MITM_PROTECTION_NOT_REQUIRED;
            sid_ble_drv_ctx.security_cfg.sc_mode               = SC_PAIRING_UNSUPPORTED;
            sid_ble_drv_ctx.security_cfg.encryptionKeySizeMin  = CFG_ENCRYPTION_KEY_SIZE_MIN;
            sid_ble_drv_ctx.security_cfg.encryptionKeySizeMax  = CFG_ENCRYPTION_KEY_SIZE_MAX;
            sid_ble_drv_ctx.security_cfg.use_fixed_pin         = SID_STM32_BLE_PRV_CI_GAP_SECURITY_CFG_FIXED_PIN_DISABLED;
            sid_ble_drv_ctx.security_cfg.fixed_pin             = CFG_FIXED_PIN;
            sid_ble_drv_ctx.security_cfg.enable_bonding        = FALSE;
            sid_ble_drv_ctx.security_cfg.identity_address_type = GAP_STATIC_RANDOM_ADDR;
        }
        else
        {
            sid_ble_drv_ctx.security_cfg.keypress_support      = CFG_KEYPRESS_NOTIFICATION_SUPPORT;
            sid_ble_drv_ctx.security_cfg.mitm_mode             = CFG_MITM_PROTECTION;
            sid_ble_drv_ctx.security_cfg.sc_mode               = (CFG_SC_SUPPORT == SC_PAIRING_ONLY) && (SPBP_OPERATING_MODE_CONCURRENT == init_type) ? SC_PAIRING_OPTIONAL : CFG_SC_SUPPORT; /* Override SC_PAIRING_ONLY if Sidewalk will run concurrently */
            sid_ble_drv_ctx.security_cfg.encryptionKeySizeMin  = CFG_ENCRYPTION_KEY_SIZE_MIN;
            sid_ble_drv_ctx.security_cfg.encryptionKeySizeMax  = CFG_ENCRYPTION_KEY_SIZE_MAX;
            sid_ble_drv_ctx.security_cfg.use_fixed_pin         = (CFG_ENABLE_FIXED_PIN_PAIRING != 0u) ? SID_STM32_BLE_PRV_CI_GAP_SECURITY_CFG_FIXED_PIN_ENABLED : SID_STM32_BLE_PRV_CI_GAP_SECURITY_CFG_FIXED_PIN_DISABLED;
            sid_ble_drv_ctx.security_cfg.fixed_pin             = CFG_FIXED_PIN;
            sid_ble_drv_ctx.security_cfg.enable_bonding        = CFG_BONDING_MODE;
#if SID_STM32_BLE_USE_RANDOM_IDENTITY_ADDRESS
            sid_ble_drv_ctx.security_cfg.identity_address_type = GAP_STATIC_RANDOM_ADDR;
#else
            sid_ble_drv_ctx.security_cfg.identity_address_type = GAP_PUBLIC_ADDR;
#endif /* SID_STM32_BLE_USE_RANDOM_IDENTITY_ADDRESS */
        }

        ret = aci_gap_set_authentication_requirement(sid_ble_drv_ctx.security_cfg.enable_bonding,
                                                     sid_ble_drv_ctx.security_cfg.mitm_mode,
                                                     sid_ble_drv_ctx.security_cfg.sc_mode,
                                                     sid_ble_drv_ctx.security_cfg.keypress_support,
                                                     sid_ble_drv_ctx.security_cfg.encryptionKeySizeMin,
                                                     sid_ble_drv_ctx.security_cfg.encryptionKeySizeMax,
                                                     sid_ble_drv_ctx.security_cfg.use_fixed_pin,
                                                     sid_ble_drv_ctx.security_cfg.fixed_pin,
                                                     sid_ble_drv_ctx.security_cfg.identity_address_type);
        if (ret != BLE_STATUS_SUCCESS)
        {
            SID_PAL_LOG_ERROR("  Fail   : aci_gap_set_authentication_requirement command, result: 0x%02X", ret);
            err = SID_ERROR_IO_ERROR;
            break;
        }
        SID_PAL_LOG_DEBUG("  Success: aci_gap_set_authentication_requirement command");

