stm32-hotspot/STM32-Sidewalk-SDK/pal/st/stm32wba/sid_pal/ble_adapter/sid_pal_ble_adapter_stm32wba.c
        /* Always enable RPA resolution in the Controller since any peer may use RPA address */
        ret = hci_le_set_address_resolution_enable(0x01u);
        if (ret != BLE_STATUS_SUCCESS)
        {
            SID_PAL_LOG_ERROR("  Fail   : hci_le_set_address_resolution_enable command, result: 0x%02X", ret);
            err = SID_ERROR_IO_ERROR;
            break;
        }
        SID_PAL_LOG_DEBUG("  Success: hci_le_set_address_resolution_enable command");

        /* Configure RPA rotation timeout */
        ret = hci_le_set_resolvable_private_address_timeout(SID_STM32_BLE_RPA_ROTATION_TIMEOUT);
        if (ret != BLE_STATUS_SUCCESS)
        {
            SID_PAL_LOG_ERROR("  Fail   : hci_le_set_resolvable_private_address_timeout command, result: 0x%02X", ret);
            err = SID_ERROR_IO_ERROR;
            break;
        }
        SID_PAL_LOG_DEBUG("  Success: hci_le_set_resolvable_private_address_timeout command");


        err = _reload_bonded_devices();
        if (err != SID_ERROR_NONE)
        {
            /* Print out a warning message, but proceed as lost bondings are not a blocking point */
            SID_PAL_LOG_WARNING("Failed to load BLE bondings. Error %d", (int32_t)err);
        }

        /* Configure own address type for ACI layer */
        uint8_t effective_own_addr_type;
        ret = GAP_Set_Own_Address(GAP_RESOLVABLE_PRIVATE_ADDR, &effective_own_addr_type, NULL);
        if (ret != BLE_STATUS_SUCCESS)
        {
            SID_PAL_LOG_ERROR("  Fail   : GAP_Set_Own_Address command, result: 0x%02X", ret);
            err = SID_ERROR_IO_ERROR;
            break;
        }

        /* Configure ACI GAP event mask */
        const uint16_t aci_gap_event_mask = (
                            /* SID_STM32_BLE_ACI_GAP_LIMITED_DISCOVERABLE_EVENT - not used */
                               SID_STM32_BLE_ACI_GAP_PAIRING_COMPLETE_EVENT
                             | SID_STM32_BLE_ACI_GAP_PASS_KEY_REQ_EVENT
                             | SID_STM32_BLE_ACI_GAP_AUTHORIZATION_REQ_EVENT
                             | SID_STM32_BLE_ACI_GAP_BOND_LOST_EVENT
                             | SID_STM32_BLE_ACI_GAP_PROC_COMPLETE_EVENT
                             | SID_STM32_BLE_ACI_L2CAP_CONNECTION_UPDATE_REQ_EVENT
                             | SID_STM32_BLE_ACI_L2CAP_CONNECTION_UPDATE_RESP_EVENT
                             | SID_STM32_BLE_ACI_L2CAP_PROC_TIMEOUT_EVENT
                             | SID_STM32_BLE_ACI_GAP_ADDR_NOT_RESOLVED_EVENT
        );
        ret = aci_gap_set_event_mask(aci_gap_event_mask);
        if (ret != BLE_STATUS_SUCCESS)
        {
            SID_PAL_LOG_ERROR("  Fail   : aci_gap_set_event_mask command, result: 0x%02X", ret);
            err = SID_ERROR_IO_ERROR;
            break;
        }
        SID_PAL_LOG_DEBUG("  Success: aci_gap_set_event_mask command");

        /* Configure ACI GATT event mask */
        const uint32_t aci_gatt_event_mask = (
                               SID_STM32_BLE_ACI_GATT_ATTRIBUTE_MODIFIED_EVENT_MASK
                             | SID_STM32_BLE_ACI_GATT_PROC_TIMEOUT_EVENT_MASK
                             | SID_STM32_BLE_ACI_ATT_EXCHANGE_MTU_RESP_EVENT_MASK
                            /* | SID_STM32_BLE_ACI_ATT_FIND_INFO_RESP_EVENT_MASK */
                            /* | SID_STM32_BLE_ACI_ATT_FIND_BY_TYPE_VALUE_RESP_EVENT_MASK */
                            /* | SID_STM32_BLE_ACI_ATT_READ_BY_TYPE_RESP_EVENT_MASK */
                            /* | SID_STM32_BLE_ACI_ATT_READ_RESP_EVENT_MASK - use ACI_GATT_READ_EXT_EVENT instead */
                            /* | SID_STM32_BLE_ACI_ATT_READ_BLOB_RESP_EVENT_MASK - use ACI_GATT_READ_EXT_EVENT instead */
                            /* | SID_STM32_BLE_ACI_ATT_READ_MULTIPLE_RESP_EVENT_MASK - use ACI_GATT_READ_EXT_EVENT instead */
                            /* | SID_STM32_BLE_ACI_ATT_READ_BY_GROUP_TYPE_RESP_EVENT_MASK */
                             | SID_STM32_BLE_ACI_ATT_PREPARE_WRITE_RESP_EVENT_MASK
                             | SID_STM32_BLE_ACI_ATT_EXEC_WRITE_RESP_EVENT_MASK
                            /* | SID_STM32_BLE_ACI_GATT_INDICATION_EVENT_MASK - use ACI_GATT_INDICATION_EXT_EVENT instead */
                            /* | SID_STM32_BLE_ACI_GATT_NOTIFICATION_EVENT_MASK - use ACI_GATT_NOTIFICATION_EXT instead */
                             | SID_STM32_BLE_ACI_GATT_ERROR_RESP_EVENT_MASK
                             | SID_STM32_BLE_ACI_GATT_PROC_COMPLETE_EVENT_MASK
                            /* | SID_STM32_BLE_ACI_GATT_DISC_READ_CHAR_BY_UUID_RESP_EVENT_MASK */
                             | SID_STM32_BLE_ACI_GATT_TX_POOL_AVAILABLE_EVENT_MASK
                             | SID_STM32_BLE_ACI_GATT_READ_EXT_EVENT_MASK
                             | SID_STM32_BLE_ACI_GATT_INDICATION_EXT_EVENT_MASK
                             | SID_STM32_BLE_ACI_GATT_NOTIFICATION_EXT_EVENT_MASK
        );
        ret = aci_gatt_set_event_mask(aci_gatt_event_mask);
        if (ret != BLE_STATUS_SUCCESS)
        {
            SID_PAL_LOG_ERROR("  Fail   : aci_gatt_set_event_mask command, result: 0x%02X", ret);
            err = SID_ERROR_IO_ERROR;
            break;
        }
        SID_PAL_LOG_DEBUG("  Success: aci_gatt_set_event_mask command");

        err = SID_ERROR_NONE;
    } while (0);

    SID_PAL_LOG_DEBUG("==>> End gap_and_gatt_params_init function");

    return err;
}

/* Private shared function definitions ---------------------------------------*/

SID_STM32_SPEED_OPTIMIZED void sid_stm32wba_ble_adapter_prv_gap_cmd_arm_resp_wait(const sid_pal_ble_prv_connection_ctx_t * const conn_ctx)
{
    SID_PAL_ASSERT(conn_ctx != NULL);
    SID_PAL_ASSERT(conn_ctx->gap_cmd_lock != NULL);

    /* Ensure Semaphore is locked */
    (void)osSemaphoreAcquire(conn_ctx->gap_cmd_lock, 0u);
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED sid_error_t sid_stm32wba_ble_adapter_prv_gap_cmd_resp_wait(const sid_pal_ble_prv_connection_ctx_t * const conn_ctx)
{
    sid_error_t    err;
    osStatus_t     os_status;
    const uint32_t t0 = osKernelGetTickCount();
    uint32_t       elapsed_ticks;
    uint32_t       timeout_ticks;

