stm32-hotspot/STM32-Sidewalk-SDK/pal/st/stm32wba/sid_pal/ble_adapter/sid_pal_ble_adapter_stm32wba.c
    SID_PAL_ASSERT(conn_ctx != NULL);
    SID_PAL_ASSERT(conn_ctx->gap_cmd_lock != NULL);

    /* Compute maximum wait time for the BLE connection to actually disconnect after GAP command was sent - used to avoid deadlocks */
    const uint32_t initial_disconnect_timeout_ms = BLE_ADAPTER_CALCULATE_DISCONNECT_TIMEOUT_MS(conn_ctx);

    /* Convert wait time to OS ticks */
    timeout_ticks = BLE_ADAPTER_MS_TO_OS_TICKS(initial_disconnect_timeout_ms);

    do
    {
        /* Wait till GAP cmd completion */
        os_status = osSemaphoreAcquire(conn_ctx->gap_cmd_lock, timeout_ticks);

        /* Capture elapsed wait time */
        elapsed_ticks = osKernelGetTickCount() - t0;

        /* Evaluate wait results */
        switch (os_status)
        {
            case osOK:
                /* Everything is fine, BLE disconnected within the timeout */
                SID_BLE_GENERIC_LOG_DEBUG("Actual BLE disconnect time for conn handle 0x%04X: %ums",conn_ctx->public_ctx.conn_id, BLE_ADAPTER_OS_TICKS_TO_MS(elapsed_ticks));
                err = SID_ERROR_NONE;
                break;

            case osErrorParameter:
                /* Most probably this function was called in an IRQ context */
                err = SID_ERROR_INVALID_STATE;
                break;

            case osErrorTimeout:
                /* Timeout on wait, let's check a few things */
                {
                    /* BLE connection parameters, including the supervision interval might have changed during the wait time -> compute the applicable disconnection wait timeout now with the actual connection parameters */
                    const uint32_t new_disconnect_timeout_ms = BLE_ADAPTER_CALCULATE_DISCONNECT_TIMEOUT_MS(conn_ctx);

                    if (BLE_ADAPTER_MS_TO_OS_TICKS(new_disconnect_timeout_ms) > elapsed_ticks)
                    {
                        /* Indeed, the new timeout value is longer -> re-adjust to the new realm and continue to wait */
                        timeout_ticks = BLE_ADAPTER_MS_TO_OS_TICKS(new_disconnect_timeout_ms) - elapsed_ticks;
                        SID_BLE_GENERIC_LOG_DEBUG("Extended BLE disconnect timeout for conn handle 0x%04X by %ums. Original timeout: %u, new: %u",
                                                  conn_ctx->public_ctx.conn_id,
                                                  BLE_ADAPTER_OS_TICKS_TO_MS(timeout_ticks),
                                                  initial_disconnect_timeout_ms,
                                                  new_disconnect_timeout_ms
                                                );
                        err = SID_ERROR_TRY_AGAIN;
                    }
                    else
                    {
                        err = SID_ERROR_TIMEOUT;
                    }
                }
                break;

            default:
                /* Normally this should not ever happen */
                err = SID_ERROR_GENERIC;
                break;
        }
    } while (SID_ERROR_TRY_AGAIN == err);

    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED sid_error_t sid_stm32wba_ble_adapter_prv_rotate_random_mac_address(sid_pal_ble_prv_bt_addr_buffer_t * const out_addr, const sid_ble_cfg_mac_address_type_t addr_type)
{
    sid_pal_ble_prv_bt_addr_buffer_t rand_bd_addr;
    tBleStatus ble_ret;
    sid_error_t err = SID_ERROR_GENERIC;

    do
    {
        /* Generate the requested random address type */
        switch (addr_type)
        {
            case SID_BLE_CFG_MAC_ADDRESS_TYPE_STATIC_RANDOM:
                err = sid_stm32wba_ble_adapter_util_get_host_static_random_addr(&rand_bd_addr);
                break;

            case SID_BLE_CFG_MAC_ADDRESS_TYPE_RANDOM_PRIVATE_NON_RESOLVABLE:
                err = sid_stm32wba_ble_adapter_util_generate_private_nonresolvable_random_mac_address(&rand_bd_addr);
                break;

            case SID_BLE_CFG_MAC_ADDRESS_TYPE_RANDOM_PRIVATE_RESOLVABLE:
                /* For RPA address updates are managed by the BLE Controller, non-resolvable address is used as a fall-back, so rotate non-resolvable address here */
                err = sid_stm32wba_ble_adapter_util_generate_private_nonresolvable_random_mac_address(&rand_bd_addr);
                break;

            case SID_BLE_CFG_MAC_ADDRESS_TYPE_PUBLIC:
            default:
                err = SID_ERROR_INVALID_ARGS;
                break;
        }

        if (err != SID_ERROR_NONE)
        {
            SID_PAL_LOG_ERROR("  Fail   : Unable to generate random device address, error code: %d", (int32_t)err);
            break;
        }

        /* Store random address value to configuration */
        ble_ret = aci_hal_write_config_data(CONFIG_DATA_RANDOM_ADDRESS_OFFSET, CONFIG_DATA_RANDOM_ADDRESS_LEN, (uint8_t*)rand_bd_addr.bytes);
        if (ble_ret != BLE_STATUS_SUCCESS)
        {
            SID_PAL_LOG_ERROR("  Fail   : aci_hal_write_config_data command - CONFIG_DATA_RANDOM_ADDRESS_OFFSET, result: 0x%02X", ble_ret);
            err = SID_ERROR_IO_ERROR;
            break;
        }
        SID_PAL_LOG_DEBUG("  Success: aci_hal_write_config_data command - CONFIG_DATA_RANDOM_ADDRESS_OFFSET");

        /* Store random address value to host controller */
        ble_ret = hci_le_set_random_address((uint8_t*)rand_bd_addr.bytes);
        if (ble_ret != BLE_STATUS_SUCCESS)
        {
            SID_PAL_LOG_ERROR("  Fail   : hci_le_set_random_address command, result: 0x%02X", ble_ret);
            err = SID_ERROR_IO_ERROR;
            break;
        }
        SID_PAL_LOG_DEBUG("  Success: hci_le_set_random_address command");

        SID_PAL_LOG_DEBUG("   Random Bluetooth Address: %02x:%02x:%02x:%02x:%02x:%02x", rand_bd_addr.bytes[5],
                                                                                        rand_bd_addr.bytes[4],
                                                                                        rand_bd_addr.bytes[3],
                                                                                        rand_bd_addr.bytes[2],
                                                                                        rand_bd_addr.bytes[1],
                                                                                        rand_bd_addr.bytes[0]);

        /* Store the generated address if requested */
        if (out_addr != NULL)
        {
            SID_STM32_UTIL_fast_memcpy(out_addr, &rand_bd_addr, sizeof(out_addr));
        }
    } while (0);

