stm32-hotspot/STM32-Sidewalk-SDK/pal/st/stm32wba/sid_pal/ble_adapter/sid_pal_ble_adapter_stm32wba.c
    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED sid_error_t sid_stm32wba_ble_adapter_prv_platform_init(void)
{
    sid_error_t err;

    do
    {
#if (SID_STM32_BLE_COEXISTENCE_MODE == SID_STM32_BLE_COEXISTENCE_MODE_INTERLEAVING) || (SID_STM32_BLE_COEXISTENCE_MODE == SID_STM32_BLE_COEXISTENCE_MODE_CONCURRENCY)
        err = sid_stm32wba_ble_adapter_user_platform_init();
        if (err != SID_ERROR_NONE)
        {
            break;
        }
#endif /* SID_STM32_BLE_COEXISTENCE_MODE */

        /* Done */
        err = SID_ERROR_NONE;
    } while (0);

    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED sid_error_t sid_stm32wba_ble_adapter_prv_generic_init(const sid_pal_ble_prv_operating_mode_t init_type, const sid_ble_config_t * const sid_ble_cfg)
{
    sid_error_t err = SID_ERROR_GENERIC;

    SID_PAL_LOG_DEBUG("==>> Start ble_adapter_generic_init function");

    do
    {
        /* Run in a critical section to avoid race conditions during stack initialization */
        sid_pal_enter_critical_region();
        if (sid_ble_drv_ctx.init_counter != 0u)
        {
            /* BLE hardware and stack is initialized already, no actions required */
            sid_ble_drv_ctx.init_counter++;
            err = SID_ERROR_NONE;
            __COMPILER_BARRIER();
            sid_pal_exit_critical_region();
            break;
        }
        else
        {
            /* Increment the counter now since we have to leave the critical section to allow RTOS resources creation (CMSIS cannot allocate resource in a critical section) */
            sid_ble_drv_ctx.init_counter++;
            __COMPILER_BARRIER();
        }
        sid_pal_exit_critical_region();

        /* Invalidate all connection contexts now, even if there are not initialized yet */
        _ble_adapter_generic_invalidate_conn_ctx(NULL);

        /* Get the extended config from the user app */
        const sid_ble_adapter_ext_cfg_t * const ext_cfg = sid_pal_ble_adapter_ext_get_link_config();

        /* Validate the config */
        if (NULL == ext_cfg)
        {
            SID_PAL_LOG_ERROR("Extended BLE adapter config is NULL");
            err = SID_ERROR_INVALID_ARGS;
            break;
        }

        /* Store extended config for future use */
        sid_ble_drv_ctx.cfg = ext_cfg;

        /* Load Sidewalk-specific BLE parameters from the fixed driver config */
        sid_ble_sidewalk_ctx.ble_cfg = sid_ble_cfg;
        SID_PAL_ASSERT(sid_ble_sidewalk_ctx.ble_cfg != NULL);
        SID_PAL_ASSERT((sid_ble_sidewalk_ctx.ble_cfg->adv_param.fast_enabled != FALSE) || (sid_ble_sidewalk_ctx.ble_cfg->adv_param.slow_enabled != FALSE)); /* At least one advertisement option shall be enabled */

        /* Init stack library and associated OS resources */
        err = _ble_stack_init(init_type);
        if (err != SID_ERROR_NONE)
        {
            break;
        }

        /* Initialize BLE Host Controller */
        err = _gap_and_gatt_params_init(init_type);
        if (err != SID_ERROR_NONE)
        {
            break;
        }

#if SID_STM32_BLE_EXTENDED_ADV_SUPPORTED
        uint8_t    supported_adv_sets_num = 0u;
        tBleStatus ble_status;

        /* Check the host controller supports the required number of advertisement sets */
        ble_status = hci_le_read_number_of_supported_advertising_sets(&supported_adv_sets_num);
        if (ble_status != BLE_STATUS_SUCCESS)
        {
            SID_PAL_LOG_ERROR("==>> hci_le_read_number_of_supported_advertising_sets - fail, result: 0x%02X", ble_status);
            err = SID_ERROR_IO_ERROR;
            break;
        }

        if (SID_STM32_BLE_GAP_MAX_ADV_SETS_NUM > supported_adv_sets_num)
        {
            SID_PAL_LOG_ERROR("BLE config mismatch. Software needs %u advertisement sets, but hardware supports only %u", SID_STM32_BLE_GAP_MAX_ADV_SETS_NUM, supported_adv_sets_num);
            err = SID_ERROR_INVALID_STATE;
            break;
        }
#endif /* SID_STM32_BLE_EXTENDED_ADV_SUPPORTED */

        /* Generic init before any GATT services can be added */
        SVCCTL_Init();

        /* Setup local SVC event handlers management */
        _ble_adapter_generic_svc_event_handling_init();

        err = _ble_adapter_generic_conn_ctxs_init();
        if (err != SID_ERROR_NONE)
        {
            /* Logs provided by _ble_adapter_generic_conn_ctxs_init() */
            break;
        }

        /* Store the activated driver operating mode */
        sid_ble_drv_ctx.operating_mode = init_type;

        /* Disable RFTS Bypass for flash operation - Since LL is about to start */
        FD_SetStatus(FD_FLASHACCESS_RFTS_BYPASS, LL_FLASH_DISABLE);

        /* From here on, all initialization is BLE application specific */
        SID_PAL_LOG_DEBUG("  Generic BLE init done");

        err = SID_ERROR_NONE;
    } while (0);

    /* Release partially allocated resources if init has failed */
    if (err != SID_ERROR_NONE)
    {
        (void)sid_stm32wba_ble_adapter_prv_generic_deinit();
    }

    SID_PAL_LOG_DEBUG("==>> End ble_adapter_generic_init function");

    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED sid_error_t sid_stm32wba_ble_adapter_prv_generic_deinit(void)
{
    sid_error_t err = SID_ERROR_GENERIC;
    sid_error_t rtos_resource_deinit_err = SID_ERROR_NONE;
    osStatus_t  os_status;
    tBleStatus  ble_staus;
    uint32_t    ll_lock_acquired = FALSE;

    SID_PAL_LOG_DEBUG("==>> Start ble_adapter_generic_deinit function");

    /* Ensure LL lock is acqwuired by trhe caller */
    if (osMutexGetOwner(LinkLayerMutex) != osThreadGetId())
    {
        /* Wait for any potentially ongoing BLE operations to stop */
        os_status = osMutexAcquire(LinkLayerMutex, SID_STM32_BLE_LL_MUTEX_WAIT_TIMEOUT_ON_DEINIT_TICKS);

        /* Print out warning but proceed */
        if (os_status != osOK)
        {
            SID_PAL_LOG_WARNING("Failed to acquire BLE LL mutex, race conditions are possible during BLE deinit");
        }
        else
        {
            ll_lock_acquired = TRUE;
        }
    }

    do
    {
        sid_pal_enter_critical_region();
        if (0u == sid_ble_drv_ctx.init_counter)
        {
            /* Deinitialized already */
            sid_pal_exit_critical_region();
            err = SID_ERROR_NONE;
            break;
        }
        else
        {
            /* Decrement initialization counter */
            sid_ble_drv_ctx.init_counter--;
            __DSB();
        }

        /* Check if any driver references left */
        if (sid_ble_drv_ctx.init_counter > 0u)
        {
            /* There are still some active driver users, keep  the driver initialized */
            sid_pal_exit_critical_region();
            err = SID_ERROR_NONE;
            break;
        }

        /* No active users left, proceed with full deinitialization */
        sid_pal_exit_critical_region();

