stm32-hotspot/STM32-Sidewalk-SDK/pal/st/stm32wba/sid_pal/ble_adapter/sid_pal_ble_adapter_stm32wba.c
        /*----------------------------------------------------------------------------*/

        /*Force HCI into standby mode*/
        if (ll_sys_dp_slp_get_state() == LL_SYS_DP_SLP_DISABLED)
        {
            /* No next radio event scheduled */
            (void)ll_sys_dp_slp_enter(LL_DP_SLP_NO_WAKEUP);
        }

        /* Deallocate RTOS resources */
#if (SID_STM32_BLE_EXTENDED_ADV_SUPPORTED == 0)
        sid_pal_enter_critical_region();
        /* Don't care if the timer was actually stopped */
        (void)UTIL_TIMER_Stop(&sid_ble_drv_ctx.adv_timer);
        sid_ble_drv_ctx.adv_timer.Callback = NULL;
        sid_ble_drv_ctx.adv_timer.argument = NULL;
        sid_pal_exit_critical_region();

        os_status = osThreadTerminate(sid_ble_drv_ctx.advertising_cmd_task);
        sid_ble_drv_ctx.advertising_cmd_task = NULL;
        os_status != osOK ? rtos_resource_deinit_err = SID_ERROR_UNINITIALIZED : (void)0;
        os_status = osMessageQueueDelete(sid_ble_drv_ctx.advertising_cmd_queue);
        sid_ble_drv_ctx.advertising_cmd_queue = NULL;
        os_status != osOK ? rtos_resource_deinit_err = SID_ERROR_UNINITIALIZED : (void)0;
#endif /* SID_STM32_BLE_EXTENDED_ADV_SUPPORTED */

        os_status = osThreadTerminate(hci_async_evt_task);
        hci_async_evt_task = NULL;
        os_status != osOK ? rtos_resource_deinit_err = SID_ERROR_UNINITIALIZED : (void)0;
        os_status = osSemaphoreDelete(hci_async_evt_semaphore);
        os_status != osOK ? rtos_resource_deinit_err = SID_ERROR_UNINITIALIZED : (void)0;
        hci_async_evt_semaphore = NULL;

        os_status = osThreadTerminate(ble_host_task);
        ble_host_task = NULL;
        os_status != osOK ? rtos_resource_deinit_err = SID_ERROR_UNINITIALIZED : (void)0;
        os_status = osSemaphoreDelete(BleHostSemaphore);
        BleHostSemaphore = NULL;
        os_status != osOK ? rtos_resource_deinit_err = SID_ERROR_UNINITIALIZED : (void)0;

        ble_staus = BLE_TIMER_Deinit();
        ble_staus != osOK ? rtos_resource_deinit_err = SID_ERROR_UNINITIALIZED : (void)0;

        /* Free up connection contexts */
        _ble_adapter_generic_conn_ctxs_deinit();

        sid_ble_drv_ctx.operating_mode = SPBP_OPERATING_MODE_OFF;

        /* Clear any residual unprocessed BLE events */
        sid_pal_enter_critical_region();
        while (LST_is_empty(&BleAsynchEventQueue) == FALSE)
        {
            BleEvtPacket_t *phcievt;

            LST_remove_head (&BleAsynchEventQueue, (tListNode **)&phcievt);
            AMM_Free((uint32_t *)phcievt);
        }
        sid_pal_exit_critical_region();

        /**
         * Workaround across lack of de-initialization support in LL - call custom de-initalization code to release LL task, Temperature Measurement task,
         * and associated resources (timers, mutexes, semaphores, etc.)
         *
         * WARNING: LinkLayerMutex becomes invalid after this point
         */
        ll_sys_dependencies_deinit();

        /* Enabble RFTS Bypass for flash operation - since LL is terminated */
        FD_SetStatus(FD_FLASHACCESS_RFTS_BYPASS, LL_FLASH_ENABLE);

        /* Done */
        err = SID_ERROR_NONE;
    } while (0);

    if ((ll_lock_acquired != FALSE) && (LinkLayerMutex != NULL))
    {
        os_status = osMutexRelease(LinkLayerMutex);
        if (os_status != osOK)
        {
            SID_PAL_LOG_ERROR("Failed to release BLE LL mutex. BLE stack will be blocked till reset");
            err = SID_ERROR_UNRECOVERABLE;
        }
    }

    /* Select error to report */
    err = (err != SID_ERROR_NONE ? err : rtos_resource_deinit_err);

    SID_PAL_LOG_DEBUG("==>> End ble_adapter_generic_deinit function");

    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED sid_error_t sid_stm32wba_ble_adapter_prv_generic_start_advertisement(Adv_Set_t * const adv_set)
#if SID_STM32_BLE_EXTENDED_ADV_SUPPORTED
{
    sid_error_t err = SID_ERROR_GENERIC;
    tBleStatus  ble_status;

    do
    {
        /* Validate inputs */
        if (NULL == adv_set)
        {
            err = SID_ERROR_INVALID_ARGS;
            break;
        }

        if (SPBP_OPERATING_MODE_OFF == sid_ble_drv_ctx.operating_mode)
        {
            err = SID_ERROR_INVALID_STATE;
            break;
        }

        /* Start advertising */
        ble_status = hci_le_set_extended_advertising_enable(SID_BLE_HCI_SET_ADV_ENABLE, 1u, adv_set);
        if (ble_status != BLE_STATUS_SUCCESS)
        {
            SID_PAL_LOG_ERROR("==>> hci_le_set_extended_advertising_enable - fail, result: 0x%02X, set: 0x%02X", ble_status, adv_set->Advertising_Handle);
            err = SID_ERROR_IO_ERROR;
            break;
        }
        SID_PAL_LOG_DEBUG("==>> hci_le_set_extended_advertising_enable - Success, set: 0x%02X", adv_set->Advertising_Handle);

        /* Done */
        err = SID_ERROR_NONE;
    } while (0);

    return err;
}
#else
{
    sid_error_t err = SID_ERROR_GENERIC;
    tBleStatus  ble_status;

    /** 
     * Concurrency mode is not supported without the extended advertising. Normally this should never happen
     * unless there's systematic failure in the configuration.
     */
    SID_PAL_ASSERT(sid_ble_drv_ctx.operating_mode != SPBP_OPERATING_MODE_CONCURRENT);

    do
    {
        /* Validate inputs */
        if (NULL == adv_set)
        {
            err = SID_ERROR_INVALID_ARGS;
            break;
        }

        if (SPBP_OPERATING_MODE_OFF == sid_ble_drv_ctx.operating_mode)
        {
            err = SID_ERROR_INVALID_STATE;
            break;
        }

        const uint32_t adv_duration = adv_set->Duration;

        /* Start advertising */
        ble_status = hci_le_set_advertising_enable(SID_BLE_HCI_SET_ADV_ENABLE);
        if (ble_status != BLE_STATUS_SUCCESS)
        {
            SID_PAL_LOG_ERROR("==>> hci_le_set_advertising_enable - fail, result: 0x%02X", ble_status);
            err = SID_ERROR_IO_ERROR;
            break;
        }
        SID_PAL_LOG_DEBUG("==>> hci_le_set_advertising_enable - Success");

