stm32-hotspot/STM32-Sidewalk-SDK/pal/st/stm32wba/sid_pal/ble_adapter/sid_pal_ble_adapter_stm32wba.c
        /* Check if this advertisement is limited in time */
        if (adv_duration != 0u)
        {
            /* Set reference to the advertised link type */
            sid_ble_drv_ctx.adv_timer.argument = (void *)(uint32_t)adv_set->Advertising_Handle;

            /* Start the timer */
            UTIL_TIMER_Status_t timer_ret = UTIL_TIMER_StartWithPeriod(&sid_ble_drv_ctx.adv_timer, SID_STM32_BLE_ADV_DURATION_UNITS_TO_MS(adv_duration));
            if (timer_ret != UTIL_TIMER_OK)
            {
                SID_PAL_LOG_ERROR("Cannot start advertisement timer. Advertisement will run indefinitely. Error %d", timer_ret);
                err = SID_ERROR_IO_ERROR;
                break;
            }
        }

        /* Done */
        err = SID_ERROR_NONE;
    } while (0);

    return err;
}
#endif /* SID_STM32_BLE_EXTENDED_ADV_SUPPORTED */

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED sid_error_t sid_stm32wba_ble_adapter_prv_generic_stop_advertisement(const uint32_t adv_set_handle)
{
    sid_error_t err = SID_ERROR_GENERIC;
    tBleStatus  ble_status;

    do
    {
#if SID_STM32_BLE_EXTENDED_ADV_SUPPORTED
        /* Validate inputs */
        if (adv_set_handle > SID_BLE_HCI_ADV_HANDLE_MAX)
        {
            err = SID_ERROR_INVALID_ARGS;
            break;
        }

        /* Stop advertisement for the specified set */
        const Adv_Set_t adv_set = {
            .Advertising_Handle              = (uint8_t)adv_set_handle,
            .Duration                        = 0u,
            .Max_Extended_Advertising_Events = 0u,
        };

        ble_status = hci_le_set_extended_advertising_enable(SID_BLE_HCI_SET_ADV_DISABLE, 1u, &adv_set);
        if (ble_status != BLE_STATUS_SUCCESS)
        {
            SID_PAL_LOG_ERROR("hci_le_set_extended_advertising_disable - fail, result: 0x%02X, set: 0x%02X", ble_status, adv_set_handle);
            err = SID_ERROR_IO_ERROR;
            break;
        }
        SID_PAL_LOG_DEBUG("==>> hci_le_set_extended_advertising_disable - Success, set: 0x%02X", adv_set_handle);

        /* Done */
        err = SID_ERROR_NONE;
#else
        /* Extended advertising is not supported, fall back to the legacy API */
        UTIL_TIMER_Status_t timer_err;

        (void)adv_set_handle;

        /* Ensure the advertisement timer is stopped */
        timer_err = UTIL_TIMER_Stop(&sid_ble_drv_ctx.adv_timer);
        /* Don't terminate here - we still need to send HCI command to stop the advertisement */

        /* Stop the actual advertisement */
        ble_status = hci_le_set_advertising_enable(SID_BLE_HCI_SET_ADV_DISABLE);

        /* Process the results */
        err = SID_ERROR_NONE;
        if (timer_err != UTIL_TIMER_OK)
        {
            SID_PAL_LOG_ERROR("Failed to stop BLE advertisement timer. Error %u", timer_err);
            err = SID_ERROR_IO_ERROR;
            /* Don't terminate, process the HCI return value */
        }
        if (ble_status != BLE_STATUS_SUCCESS)
        {
            SID_PAL_LOG_ERROR("hci_le_set_advertising_disable - fail, result: 0x%02X", ble_status);
            err = SID_ERROR_IO_ERROR;
        }
        SID_PAL_LOG_DEBUG("==>> hci_le_set_advertising_disable - Success");
        if (err != SID_ERROR_NONE)
        {
            /* Terminate from here */
            break;
        }
#endif /* SID_STM32_BLE_EXTENDED_ADV_SUPPORTED */
    } while (0);

    return err;
}

/*----------------------------------------------------------------------------*/

#if (SID_STM32_BLE_ENHANCED_MTU_EXCHANGE_HANDLING && SID_STM32_BLE_GATT_EXCHANGE_CONFIG_SUPPORTED)
/**
 * If the enhanced MTU exchange handling is enabled and GCC toolchain is used, the ATT_Build_Exchg_Mtu_Req() and
 * ATT_Build_Exchg_Mtu_Rsp() functions should be wrapped by linker using -Wl,--wrap=ATT_Build_Exchg_Mtu_Req and
 * -Wl,--wrap=ATT_Build_Exchg_Mtu_Rsp flags.
 */
SID_STM32_FUNC_WRAPPER_DECLARE_WRAPPED_FUNCTION(SID_STM32_SPEED_OPTIMIZED tBleStatus, ATT_Build_Exchg_Mtu_Req(sid_pal_ble_prv_conn_ctx_mock_t * const bearer, sid_pal_ble_prv_client_pdu_mock_t * const out_exch_mtu_req))
{
    tBleStatus ble_status;

    SID_PAL_ASSERT(bearer != NULL);
    SID_PAL_ASSERT(out_exch_mtu_req != NULL);

    do
    {
        /* Call the original method to build Exchange MTU Request PDU */
        ble_status = SID_STM32_FUNC_WRAPPER_CALL_ORIGINAL_FUNCTION(ATT_Build_Exchg_Mtu_Req(bearer, out_exch_mtu_req));
        if (ble_status != BLE_STATUS_SUCCESS)
        {
            break;
        }

        /* Checks to detect if local definitions are not aligned with the BLE stack */
        SID_PAL_ASSERT(SID_STM32_BLE_PRV_ATT_EXCHANGE_MTU_REQ_SZ == out_exch_mtu_req->frame_len);
        SID_PAL_ASSERT(out_exch_mtu_req->l2cap_frame != NULL);
        SID_PAL_ASSERT(SID_STM32_BLE_PRV_ATT_EXCHANGE_MTU_REQ_OPCODE == out_exch_mtu_req->l2cap_frame->att_pdu.opcode);

        /* Locate the associated generic connection context for the connection */
        const sid_pal_ble_prv_connection_ctx_t * const conn_ctx = _ble_adapter_generic_get_conn_ctx_for_handle(bearer->conn_handle);

        /* Apply connection-specific MTU restrictions if the context exists */
        if (conn_ctx != NULL)
        {
            /* Ensure the requested connection-specific ATT MTU size does not exceed the one set in the controller */
            SID_PAL_ASSERT(conn_ctx->public_ctx.max_mtu_size <= out_exch_mtu_req->l2cap_frame->att_pdu.exchange_mtu_req.client_rx_mtu);
            out_exch_mtu_req->l2cap_frame->att_pdu.exchange_mtu_req.client_rx_mtu = conn_ctx->public_ctx.max_mtu_size;
        }

        ble_status = BLE_STATUS_SUCCESS;
    } while (0);

    return ble_status;
}
#endif /* SID_STM32_BLE_ENHANCED_MTU_EXCHANGE_HANDLING && SID_STM32_BLE_GATT_EXCHANGE_CONFIG_SUPPORTED */

/*----------------------------------------------------------------------------*/

#if SID_STM32_BLE_ENHANCED_MTU_EXCHANGE_HANDLING
/**
 * If the enhanced MTU exchange handling is enabled and GCC toolchain is used, the ATT_Build_Exchg_Mtu_Req() and
 * ATT_Build_Exchg_Mtu_Rsp() functions should be wrapped by linker using -Wl,--wrap=ATT_Build_Exchg_Mtu_Req and
 * -Wl,--wrap=ATT_Build_Exchg_Mtu_Rsp flags.
 */
SID_STM32_FUNC_WRAPPER_DECLARE_WRAPPED_FUNCTION(SID_STM32_SPEED_OPTIMIZED tBleStatus, ATT_Build_Exchg_Mtu_Rsp(sid_pal_ble_prv_conn_ctx_mock_t * const bearer, sid_pal_ble_prv_client_pdu_mock_t * const in_exch_mtu_req, sid_pal_ble_prv_client_pdu_mock_t * const out_exch_mtu_rsp))
{
    tBleStatus ble_status;

    SID_PAL_ASSERT(bearer != NULL);
    SID_PAL_ASSERT(in_exch_mtu_req != NULL);
    SID_PAL_ASSERT(out_exch_mtu_rsp != NULL);

