stm32-hotspot/STM32-Sidewalk-SDK/pal/st/stm32wba/sid_pal/ble_adapter/sid_pal_ble_adapter_stm32wba.c
    /* Use critical section since we are about to modify connection context for one of the BLE connections */
    sid_pal_enter_critical_region();

    do
    {
        /* Checks to detect if local definitions are not aligned with the BLE stack */
        SID_PAL_ASSERT(SID_STM32_BLE_PRV_ATT_EXCHANGE_MTU_REQ_SZ == in_exch_mtu_req->frame_len);
        SID_PAL_ASSERT(in_exch_mtu_req->l2cap_frame != NULL);
        SID_PAL_ASSERT(SID_STM32_BLE_PRV_ATT_EXCHANGE_MTU_REQ_OPCODE == in_exch_mtu_req->l2cap_frame->att_pdu.opcode);

        /* Locate the associated generic connection context for the connection */
        const sid_pal_ble_prv_connection_ctx_t * const conn_ctx = _ble_adapter_generic_get_conn_ctx_for_handle(bearer->conn_handle);

        /* Apply connection-specific MTU restrictions if the context exists */
        if (conn_ctx != NULL)
        {
            /* Limit the requested MTU to the connection-specific ATT MTU size */
            if (in_exch_mtu_req->l2cap_frame->att_pdu.exchange_mtu_req.client_rx_mtu > conn_ctx->public_ctx.max_mtu_size)
            {
                in_exch_mtu_req->l2cap_frame->att_pdu.exchange_mtu_req.client_rx_mtu = conn_ctx->public_ctx.max_mtu_size;
            }
        }

        /* Call the original method to update MTU size and build Exchange MTU Reply PDU */
        ble_status = SID_STM32_FUNC_WRAPPER_CALL_ORIGINAL_FUNCTION(ATT_Build_Exchg_Mtu_Rsp(bearer, in_exch_mtu_req, out_exch_mtu_rsp));
        if (ble_status != BLE_STATUS_SUCCESS)
        {
            break;
        }

        /* Checks to detect if local definitions are not aligned with the BLE stack */
        SID_PAL_ASSERT(SID_STM32_BLE_PRV_ATT_EXCHANGE_MTU_RSP_SZ == out_exch_mtu_rsp->frame_len);
        SID_PAL_ASSERT(out_exch_mtu_rsp->l2cap_frame != NULL);
        SID_PAL_ASSERT(SID_STM32_BLE_PRV_ATT_EXCHANGE_MTU_RSP_OPCODE == out_exch_mtu_rsp->l2cap_frame->att_pdu.opcode);

        /* Ensure the reply does not exceed the connection-specific ATT MTU size */
        if (conn_ctx != NULL)
        {
            if (out_exch_mtu_rsp->l2cap_frame->att_pdu.exchange_mtu_rsp.server_rx_mtu > conn_ctx->public_ctx.max_mtu_size)
            {
                /* Reply with connection-specific limit instead of the global limit */
                out_exch_mtu_rsp->l2cap_frame->att_pdu.exchange_mtu_rsp.server_rx_mtu = conn_ctx->public_ctx.max_mtu_size;
            }
        }

        /* Done */
        ble_status = BLE_STATUS_SUCCESS;
    } while (0);

    sid_pal_exit_critical_region();

    return ble_status;
}
#endif /* SID_STM32_BLE_ENHANCED_MTU_EXCHANGE_HANDLING */

/*----------------------------------------------------------------------------*/

#if (SID_STM32_BLE_COEXISTENCE_MODE == SID_STM32_BLE_COEXISTENCE_MODE_INTERLEAVING) || (SID_STM32_BLE_COEXISTENCE_MODE == SID_STM32_BLE_COEXISTENCE_MODE_CONCURRENCY)
/**
 * If GCC toolchain is used, the GATT_Add_Char_Core() function should be wrapped by linker using -Wl,--wrap=GATT_Add_Char_Core.
 */
SID_STM32_FUNC_WRAPPER_DECLARE_WRAPPED_FUNCTION(tBleStatus, GATT_Add_Char_Core(uint16_t * const out_char_handle, const gatt_add_char_core_params_t * const char_def))
{
    tBleStatus ble_status;

    /* Create a local copy of the charactersitic definition because we may need to modify it */
    gatt_add_char_core_params_t char_def_refined = *char_def;

    /* Extend GAP charactersitc with GATT_NOTIFY_READ_REQ_AND_WAIT_FOR_APPL_RESP event notification */
    if ((STM32_WPAN_BLE_UUID_TYPE_16 == char_def_refined.Char_UUID_Type) &&
        (  (DEVICE_NAME_UUID == char_def_refined.Char_UUID.Char_UUID_16)
        || (APPEARANCE_UUID == char_def_refined.Char_UUID.Char_UUID_16)
        || (PERIPHERAL_PREFERRED_CONN_PARAMS_UUID == char_def_refined.Char_UUID.Char_UUID_16)
        )
    )
    {
        char_def_refined.GATT_Evt_Mask |= GATT_NOTIFY_READ_REQ_AND_WAIT_FOR_APPL_RESP;
    }

    /* Call the original function */
    ble_status = SID_STM32_FUNC_WRAPPER_CALL_ORIGINAL_FUNCTION(GATT_Add_Char_Core(out_char_handle, &char_def_refined));

    return ble_status;
}
#endif /* SID_STM32_BLE_COEXISTENCE_MODE */

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED sid_error_t sid_stm32wba_ble_adapter_prv_generic_register_svc_handler(const SVC_CTL_p_EvtHandler_t gatt_svc_event_handler)
{
    sid_error_t err = SID_ERROR_GENERIC;

    SID_PAL_ASSERT(gatt_svc_event_handler != NULL);

    sid_pal_enter_critical_region();

    do
    {
        sid_pal_ble_prv_evt_hndlr_desc_t * free_slot = NULL;

        /* Find a free slot and register the handler */
        err = SID_ERROR_NONE;
        for (uint32_t i = 0u; i < SID_STM32_UTIL_ARRAY_SIZE(sid_ble_drv_ctx.svc_event_handlers); i++)
        {
            /* Locate the first available free slot */
            if ((NULL == free_slot) && (NULL == sid_ble_drv_ctx.svc_event_handlers[i].handler))
            {
                /* Found - store the free slot location and continue to check the handler is not registered already */
                free_slot = &sid_ble_drv_ctx.svc_event_handlers[i];
            }

            /* Check the handler is not registered */
            if (gatt_svc_event_handler == sid_ble_drv_ctx.svc_event_handlers[i].handler)
            {
                /* Just increment the reference counter */
                sid_ble_drv_ctx.svc_event_handlers[i].ref_count++;
                err = SID_ERROR_ALREADY_EXISTS;
                break;
            }
        }

        if (SID_ERROR_NONE == err)
        {
            if (free_slot != NULL)
            {
                free_slot->handler = gatt_svc_event_handler;
                free_slot->ref_count = 1u;
            }
            else
            {
                /* No free slots found in the registry */
                err = SID_ERROR_OUT_OF_RESOURCES;
            }
        }
        else if (SID_ERROR_ALREADY_EXISTS == err)
        {
            /* Reference counter is incremented already, report no error */
            err = SID_ERROR_NONE;
        }
        else
        {
            /* Nothing to do, report the error */
        }
    } while (0);

    sid_pal_exit_critical_region();

