stm32-hotspot/STM32-Sidewalk-SDK/pal/st/stm32wba/sid_pal/ble_adapter/sid_pal_ble_adapter_stm32wba.c
    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED sid_error_t sid_stm32wba_ble_adapter_prv_generic_deregister_svc_handler(const SVC_CTL_p_EvtHandler_t gatt_svc_event_handler)
{
    sid_error_t err = SID_ERROR_GENERIC;

    sid_pal_enter_critical_region();

    do
    {
        /* Find the handler in the local registry and free up the slot */
        err = SID_ERROR_NOT_FOUND;
        for (uint32_t i = 0u; i < SID_STM32_UTIL_ARRAY_SIZE(sid_ble_drv_ctx.svc_event_handlers); i++)
        {
            if (gatt_svc_event_handler == sid_ble_drv_ctx.svc_event_handlers[i].handler)
            {
                /* Found - decrement reference counter */
                if (sid_ble_drv_ctx.svc_event_handlers[i].ref_count > 0u)
                {
                    sid_ble_drv_ctx.svc_event_handlers[i].ref_count--;
                }

                /* Release the slot if no references left */
                if (0u == sid_ble_drv_ctx.svc_event_handlers[i].ref_count)
                {
                    sid_ble_drv_ctx.svc_event_handlers[i].handler = NULL;
                }

                err = SID_ERROR_NONE;
                break;
            }
        }
    } while (0);

    sid_pal_exit_critical_region();

    return err;
}

/* Global function definitions -----------------------------------------------*/

#if SID_STM32_BLE_COEXISTENCE_MODE == SID_STM32_BLE_COEXISTENCE_MODE_ROUTE_NON_SID
__WEAK SVCCTL_UserEvtFlowStatus_t USER_SVCCTL_App_Notification(void *p_Pckt)
{
    /* When Routing co-existence mode is used - redefine this function in your user app */
    SID_PAL_LOG_WARNING("User variant of the SVCCTL_App_Notification function is not defined");
    return SVCCTL_UserEvtFlowEnable;
}
#endif /* SID_STM32_BLE_COEXISTENCE_MODE_ROUTE_NON_SID */

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED SVCCTL_UserEvtFlowStatus_t SVCCTL_App_Notification(void *p_Pckt)
{
#if SID_STM32_BLE_COEXISTENCE_MODE == SID_STM32_BLE_COEXISTENCE_MODE_ROUTE_NON_SID
    if (SPBP_OPERATING_MODE_OFF == sid_ble_drv_ctx.operating_mode)
    {
        /* This BLE driver is not in user, forward BLE stack events to the user-defined handler */
        return USER_SVCCTL_App_Notification(p_Pckt);
    }
#endif /* SID_STM32_BLE_COEXISTENCE_MODE_ROUTE_NON_SID */

    SVCCTL_UserEvtFlowStatus_t evt_flow_status = SVCCTL_UserEvtFlowEnable;
    const hci_event_pckt *     p_event_pckt;

    p_event_pckt = (hci_event_pckt*) ((hci_uart_pckt *) p_Pckt)->data;

    switch (p_event_pckt->evt)
    {
#if (SID_STM32_BLE_COEXISTENCE_MODE == SID_STM32_BLE_COEXISTENCE_MODE_INTERLEAVING) || (SID_STM32_BLE_COEXISTENCE_MODE == SID_STM32_BLE_COEXISTENCE_MODE_CONCURRENCY)
        case HCI_ENCRYPTION_CHANGE_EVT_CODE:
            {
                const hci_encryption_change_event_rp0 * const p_encryption_change_event = (hci_encryption_change_event_rp0 *)p_event_pckt->data;

                SID_BLE_GENERIC_LOG_DEBUG(">>== HCI_ENCRYPTION_CHANGE_EVT_CODE");

                if (SID_BLE_HCI_STATUS_SUCCESS == p_encryption_change_event->Status)
                {
                    sid_pal_enter_critical_region();

                    /* Locate the associated connection context */
                    sid_pal_ble_prv_connection_ctx_t * const conn_ctx = _ble_adapter_generic_get_conn_ctx_for_handle(p_encryption_change_event->Connection_Handle);

                    if (conn_ctx != NULL)
                    {
                        conn_ctx->public_ctx.is_secure = p_encryption_change_event->Encryption_Enabled != 0x00u ? TRUE : FALSE;
                        SID_BLE_GENERIC_LOG_DEBUG("     - Connection 0x%04X encryption changed to 0x%02X", p_encryption_change_event->Connection_Handle, p_encryption_change_event->Encryption_Enabled);

                        (void)sid_stm32wba_ble_adapter_user_on_encryption_changed(p_encryption_change_event->Connection_Handle);
                    }

                    sid_pal_exit_critical_region();
                }
                else
                {
                    SID_PAL_LOG_ERROR("BLE connection 0x%04X security change failed with status 0x%02X", p_encryption_change_event->Connection_Handle, p_encryption_change_event->Status);
                    //TODO: consider terminating the connection at this point
                }
            }
            break;
#endif /* SID_STM32_BLE_COEXISTENCE_MODE */

        case HCI_DISCONNECTION_COMPLETE_EVT_CODE:
            {
                const hci_disconnection_complete_event_rp0 * const p_disconnection_complete_event = (hci_disconnection_complete_event_rp0 *)p_event_pckt->data;

                SID_BLE_GENERIC_LOG_DEBUG(">>== HCI_DISCONNECTION_COMPLETE_EVT_CODE");
                SID_BLE_GENERIC_LOG_DEBUG("     - Connection Handle:   0x%02X", p_disconnection_complete_event->Connection_Handle);
                SID_BLE_GENERIC_LOG_DEBUG("     - Reason:    0x%02X", p_disconnection_complete_event->Reason);

                /* Manage the quantity of the bonded devices. This may generate an error if another Virtual BLE device is advertising or a connection is pending. That's normal, ignore errors at this point */
                (void)_reload_bonded_devices();

                sid_pal_enter_critical_region();

                /* Locate the associated connection context */
                sid_pal_ble_prv_connection_ctx_t * const conn_ctx = _ble_adapter_generic_get_conn_ctx_for_handle(p_disconnection_complete_event->Connection_Handle);
                
                /* Invoke Sidewalk disconnection callback if this event belongs to the Sidewalk link */
                if ((sid_ble_sidewalk_ctx.conn_ctx != NULL) && (p_disconnection_complete_event->Connection_Handle == sid_ble_sidewalk_ctx.conn_ctx->public_ctx.conn_id))
                {
                    sid_stm32wba_ble_adapter_sidewalk_on_ble_disconnected(p_disconnection_complete_event->Reason);
                }
#if (SID_STM32_BLE_COEXISTENCE_MODE == SID_STM32_BLE_COEXISTENCE_MODE_INTERLEAVING) || (SID_STM32_BLE_COEXISTENCE_MODE == SID_STM32_BLE_COEXISTENCE_MODE_CONCURRENCY)
                else
                {
                    /* Invoke user disconnection callback */
                    (void)sid_stm32wba_ble_adapter_user_on_ble_disconnected(p_disconnection_complete_event->Connection_Handle, p_disconnection_complete_event->Reason);
                }
#endif /* SID_STM32_BLE_COEXISTENCE_MODE */

                if (conn_ctx != NULL)
                {
                    /* Release GAP cmd lock - do it before the context is invalidated */
                    _gap_cmd_resp_release(conn_ctx);

                    /* Invalidate the associated generic connection context */
                    _ble_adapter_generic_invalidate_conn_ctx(conn_ctx);
                }
                sid_pal_exit_critical_region();
            }
            break;

#ifdef DEBUG
        case HCI_HARDWARE_ERROR_EVT_CODE:
            {
                const hci_hardware_error_event_rp0 * const p_hardware_error_event = (hci_hardware_error_event_rp0 *)p_event_pckt->data;

