stm32-hotspot/STM32-Sidewalk-SDK/pal/st/stm32wba/sid_pal/ble_adapter/sid_pal_ble_adapter_stm32wba.c
                SID_PAL_LOG_ERROR("BLE HCI hardware error 0x%02X", p_hardware_error_event->Hardware_Code);
            }
            break;
#endif /* DEBUG */

        case HCI_LE_META_EVT_CODE:
            evt_flow_status = _ble_adapter_generic_process_hci_le_meta_evt((evt_le_meta_event *)p_event_pckt->data);
            break;

        case HCI_VENDOR_SPECIFIC_DEBUG_EVT_CODE:
            evt_flow_status = _ble_adapter_generic_process_aci_evt((evt_blecore_aci *)p_event_pckt->data);
            break;

        default:
            /* Allow event flow to continue by default */
            break;
    }

    return evt_flow_status;
}

/*----------------------------------------------------------------------------*/

#if SID_STM32_BLE_COEXISTENCE_MODE == SID_STM32_BLE_COEXISTENCE_MODE_ROUTE_NON_SID
__WEAK uint8_t USER_BLECB_Indication(const uint8_t* data, uint16_t length, const uint8_t* ext_data, uint16_t ext_length)
{
    /* When Routing co-existence mode is used - redefine this function in your user app */
    SID_PAL_LOG_WARNING("User variant of the BLECB_Indication function is not defined");
    return 0u;
}
#endif /* SID_STM32_BLE_COEXISTENCE_MODE_ROUTE_NON_SID */

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED uint8_t BLECB_Indication(const uint8_t * data, uint16_t length, const uint8_t * ext_data, uint16_t ext_length)
{
#if SID_STM32_BLE_COEXISTENCE_MODE == SID_STM32_BLE_COEXISTENCE_MODE_ROUTE_NON_SID
    if (SPBP_OPERATING_MODE_OFF == sid_ble_drv_ctx.operating_mode)
    {
        /* This BLE driver is not in user, forward BLE stack events to the user-defined handler */
        return USER_BLECB_Indication(data, length, ext_data, ext_length);
    }
#endif /* SID_STM32_BLE_COEXISTENCE_MODE_ROUTE_NON_SID */

    uint8_t              status = BLE_STATUS_FAILED;
    AMM_Function_Error_t amm_error;
    BleEvtPacket_t *     phcievt;
    const uint32_t       total_length = ((uint32_t)length + (uint32_t)ext_length);

    (void)ext_data;

    switch (data[0])
    {
        case HCI_EVENT_PKT_TYPE:
            {
                const uint32_t alloc_size = DIVC((sizeof(BleEvtPacketHeader_t) + total_length), sizeof (uint32_t));
                
                ble_amm_cb.Callback = _ble_adapter_generic_resume_flow_process;
                amm_error = AMM_Alloc(CFG_AMM_VIRTUAL_APP_BLE, alloc_size, (uint32_t **)(void *)&phcievt, &ble_amm_cb);
                if (amm_error != AMM_ERROR_OK)
                {
                    SID_PAL_LOG_ERROR("AMM failed to allocate %u bytes to store BLE event. Error %d", alloc_size, (int32_t)amm_error);
                    status = BLE_STATUS_FAILED;
                    break;
                }
                SID_PAL_ASSERT(phcievt != NULL); /* Should never happen if AMM_ERROR_OK is returned, but just in case... */

                phcievt->evtserial.type        = HCI_EVENT_PKT_TYPE;
                phcievt->evtserial.evt.evtcode = data[1];
                phcievt->evtserial.evt.plen    = data[2];
                SID_STM32_UTIL_fast_memcpy((void*)&phcievt->evtserial.evt.payload, &data[3], phcievt->evtserial.evt.plen);

                LST_insert_tail(&BleAsynchEventQueue, (tListNode *)phcievt);
                osSemaphoreRelease(hci_async_evt_semaphore);
                status = BLE_STATUS_SUCCESS;
            }
            break;

        case HCI_ACLDATA_PKT_TYPE:
            status = BLE_STATUS_SUCCESS;
            break;

        default:
            status = BLE_STATUS_FAILED;
            break;
    }

    return status;
}

/*----------------------------------------------------------------------------*/

#if SID_STM32_BLE_COEXISTENCE_MODE == SID_STM32_BLE_COEXISTENCE_MODE_ROUTE_NON_SID
__WEAK void USER_APP_BLE_HostNvmStore(void)
{
    /* When Routing co-existence mode is used - redefine this function in your user app */
    SID_PAL_LOG_WARNING("User variant of the APP_BLE_HostNvmStore function is not defined");
}
#endif /* SID_STM32_BLE_COEXISTENCE_MODE_ROUTE_NON_SID */

/*----------------------------------------------------------------------------*/

void APP_BLE_HostNvmStore(void)
{
#if SID_STM32_BLE_COEXISTENCE_MODE == SID_STM32_BLE_COEXISTENCE_MODE_ROUTE_NON_SID
    if (SPBP_OPERATING_MODE_OFF == sid_ble_drv_ctx.operating_mode)
    {
        /* This BLE driver is not in user, forward BLE stack events to the user-defined handler */
        USER_APP_BLE_HostNvmStore();
        return;
    }
#endif /* SID_STM32_BLE_COEXISTENCE_MODE_ROUTE_NON_SID */

    SNVMA_Cmd_Status_t snvma_status;

    /* Call SNVMA for storing */
    SID_BLE_GENERIC_LOG_DEBUG("BLE NVM Store");
    snvma_status = SNVMA_Write(APP_BLE_NvmBuffer, BLE_NvmCallback);
    if (snvma_status != SNVMA_ERROR_OK)
    {
        SID_PAL_LOG_ERROR("BLE NVMA Store failed with error 0x%02X", snvma_status);
    }
}
